{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "9dd1067d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting pykeenNote: you may need to restart the kernel to use updated packages.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  DEPRECATION: click-default-group is being installed using the legacy 'setup.py install' method, because it does not have a 'pyproject.toml' and the 'wheel' package is not installed. pip 23.1 will enforce this behaviour change. A possible replacement is to enable the '--use-pep517' option. Discussion can be found at https://github.com/pypa/pip/issues/8559\n",
      "\n",
      "[notice] A new release of pip available: 22.3 -> 23.2.1\n",
      "[notice] To update, run: C:\\Users\\bless\\AppData\\Local\\Programs\\Python\\Python311\\python.exe -m pip install --upgrade pip\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "  Using cached pykeen-1.10.1-py3-none-any.whl (739 kB)\n",
      "Collecting dataclasses-json\n",
      "  Using cached dataclasses_json-0.5.13-py3-none-any.whl (26 kB)\n",
      "Requirement already satisfied: numpy in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pykeen) (1.23.4)\n",
      "Requirement already satisfied: scipy>=1.7.0 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pykeen) (1.10.1)\n",
      "Collecting click\n",
      "  Downloading click-8.1.6-py3-none-any.whl (97 kB)\n",
      "     ---------------------------------------- 97.9/97.9 kB 2.8 MB/s eta 0:00:00\n",
      "Collecting click-default-group\n",
      "  Using cached click-default-group-1.2.2.tar.gz (3.3 kB)\n",
      "  Preparing metadata (setup.py): started\n",
      "  Preparing metadata (setup.py): finished with status 'done'\n",
      "Requirement already satisfied: scikit-learn in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pykeen) (1.2.2)\n",
      "Collecting tqdm\n",
      "  Downloading tqdm-4.65.0-py3-none-any.whl (77 kB)\n",
      "     ---------------------------------------- 77.1/77.1 kB 4.2 MB/s eta 0:00:00\n",
      "Collecting requests\n",
      "  Downloading requests-2.31.0-py3-none-any.whl (62 kB)\n",
      "     ---------------------------------------- 62.6/62.6 kB 3.3 MB/s eta 0:00:00\n",
      "Collecting optuna>=2.0.0\n",
      "  Using cached optuna-3.2.0-py3-none-any.whl (390 kB)\n",
      "Requirement already satisfied: pandas>=1.0.0 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pykeen) (2.0.2)\n",
      "Collecting tabulate\n",
      "  Downloading tabulate-0.9.0-py3-none-any.whl (35 kB)\n",
      "Collecting more-click\n",
      "  Using cached more_click-0.1.2-py3-none-any.whl (6.7 kB)\n",
      "Collecting more-itertools\n",
      "  Using cached more_itertools-10.0.0-py3-none-any.whl (55 kB)\n",
      "Collecting pystow>=0.4.3\n",
      "  Using cached pystow-0.5.0-py3-none-any.whl (37 kB)\n",
      "Collecting docdata\n",
      "  Using cached docdata-0.0.3-py3-none-any.whl (5.8 kB)\n",
      "Collecting class-resolver>=0.3.10\n",
      "  Using cached class_resolver-0.4.2-py3-none-any.whl (24 kB)\n",
      "Collecting pyyaml\n",
      "  Downloading PyYAML-6.0.1-cp311-cp311-win_amd64.whl (144 kB)\n",
      "     -------------------------------------- 144.7/144.7 kB 4.2 MB/s eta 0:00:00\n",
      "Collecting rexmex>=0.1.3\n",
      "  Using cached rexmex-0.1.3.tar.gz (21 kB)\n",
      "  Installing build dependencies: started\n",
      "  Installing build dependencies: finished with status 'done'\n",
      "  Getting requirements to build wheel: started\n",
      "  Getting requirements to build wheel: finished with status 'done'\n",
      "  Installing backend dependencies: started\n",
      "  Installing backend dependencies: finished with status 'done'\n",
      "  Preparing metadata (pyproject.toml): started\n",
      "  Preparing metadata (pyproject.toml): finished with status 'done'\n",
      "Collecting torch-max-mem>=0.0.4\n",
      "  Using cached torch_max_mem-0.0.5-py3-none-any.whl (8.2 kB)\n",
      "Collecting torch-ppr>=0.0.7\n",
      "  Using cached torch_ppr-0.0.8-py3-none-any.whl (12 kB)\n",
      "Collecting protobuf<4.0.0\n",
      "  Downloading protobuf-3.20.3-py2.py3-none-any.whl (162 kB)\n",
      "     -------------------------------------- 162.1/162.1 kB 4.9 MB/s eta 0:00:00\n",
      "Collecting typing-extensions\n",
      "  Downloading typing_extensions-4.7.1-py3-none-any.whl (33 kB)\n",
      "Collecting alembic>=1.5.0\n",
      "  Using cached alembic-1.11.1-py3-none-any.whl (224 kB)\n",
      "Collecting cmaes>=0.9.1\n",
      "  Using cached cmaes-0.10.0-py3-none-any.whl (29 kB)\n",
      "Collecting colorlog\n",
      "  Using cached colorlog-6.7.0-py2.py3-none-any.whl (11 kB)\n",
      "Requirement already satisfied: packaging>=20.0 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from optuna>=2.0.0->pykeen) (21.3)\n",
      "Collecting sqlalchemy>=1.3.0\n",
      "  Downloading SQLAlchemy-2.0.19-cp311-cp311-win_amd64.whl (2.0 MB)\n",
      "     ---------------------------------------- 2.0/2.0 MB 10.5 MB/s eta 0:00:00\n",
      "Requirement already satisfied: python-dateutil>=2.8.2 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pandas>=1.0.0->pykeen) (2.8.2)\n",
      "Requirement already satisfied: pytz>=2020.1 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pandas>=1.0.0->pykeen) (2023.3)\n",
      "Requirement already satisfied: tzdata>=2022.1 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from pandas>=1.0.0->pykeen) (2023.3)\n",
      "Collecting torch>=2.0\n",
      "  Downloading torch-2.0.1-cp311-cp311-win_amd64.whl (172.3 MB)\n",
      "     -------------------------------------- 172.3/172.3 MB 4.4 MB/s eta 0:00:00\n",
      "Requirement already satisfied: colorama in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from click->pykeen) (0.4.6)\n",
      "Collecting marshmallow<4.0.0,>=3.18.0\n",
      "  Using cached marshmallow-3.20.1-py3-none-any.whl (49 kB)\n",
      "Collecting typing-inspect<1,>=0.4.0\n",
      "  Using cached typing_inspect-0.9.0-py3-none-any.whl (8.8 kB)\n",
      "Collecting charset-normalizer<4,>=2\n",
      "  Downloading charset_normalizer-3.2.0-cp311-cp311-win_amd64.whl (96 kB)\n",
      "     ---------------------------------------- 96.6/96.6 kB 5.4 MB/s eta 0:00:00\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from requests->pykeen) (3.4)\n",
      "Collecting urllib3<3,>=1.21.1\n",
      "  Downloading urllib3-2.0.4-py3-none-any.whl (123 kB)\n",
      "     -------------------------------------- 123.9/123.9 kB 7.1 MB/s eta 0:00:00\n",
      "Collecting certifi>=2017.4.17\n",
      "  Downloading certifi-2023.7.22-py3-none-any.whl (158 kB)\n",
      "     -------------------------------------- 158.3/158.3 kB 9.3 MB/s eta 0:00:00\n",
      "Requirement already satisfied: joblib>=1.1.1 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from scikit-learn->pykeen) (1.2.0)\n",
      "Requirement already satisfied: threadpoolctl>=2.0.0 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from scikit-learn->pykeen) (3.1.0)\n",
      "Collecting Mako\n",
      "  Using cached Mako-1.2.4-py3-none-any.whl (78 kB)\n",
      "Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from packaging>=20.0->optuna>=2.0.0->pykeen) (3.0.9)\n",
      "Requirement already satisfied: six>=1.5 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from python-dateutil>=2.8.2->pandas>=1.0.0->pykeen) (1.16.0)\n",
      "Collecting greenlet!=0.4.17\n",
      "  Downloading greenlet-2.0.2-cp311-cp311-win_amd64.whl (192 kB)\n",
      "     ------------------------------------- 192.5/192.5 kB 11.4 MB/s eta 0:00:00\n",
      "Collecting filelock\n",
      "  Downloading filelock-3.12.2-py3-none-any.whl (10 kB)\n",
      "Collecting sympy\n",
      "  Downloading sympy-1.12-py3-none-any.whl (5.7 MB)\n",
      "     ---------------------------------------- 5.7/5.7 MB 10.5 MB/s eta 0:00:00\n",
      "Collecting networkx\n",
      "  Downloading networkx-3.1-py3-none-any.whl (2.1 MB)\n",
      "     ---------------------------------------- 2.1/2.1 MB 11.0 MB/s eta 0:00:00\n",
      "Requirement already satisfied: jinja2 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from torch>=2.0->torch-max-mem>=0.0.4->pykeen) (3.1.2)\n",
      "Collecting mypy-extensions>=0.3.0\n",
      "  Downloading mypy_extensions-1.0.0-py3-none-any.whl (4.7 kB)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from jinja2->torch>=2.0->torch-max-mem>=0.0.4->pykeen) (2.1.1)\n",
      "Collecting mpmath>=0.19\n",
      "  Downloading mpmath-1.3.0-py3-none-any.whl (536 kB)\n",
      "     ------------------------------------- 536.2/536.2 kB 11.2 MB/s eta 0:00:00\n",
      "Building wheels for collected packages: rexmex\n",
      "  Building wheel for rexmex (pyproject.toml): started\n",
      "  Building wheel for rexmex (pyproject.toml): finished with status 'done'\n",
      "  Created wheel for rexmex: filename=rexmex-0.1.3-py3-none-any.whl size=19965 sha256=3df67cb6bfdeb24544e6cef255fefa5b0506a8e55c925258e8d20f1a19e91db3\n",
      "  Stored in directory: c:\\users\\bless\\appdata\\local\\pip\\cache\\wheels\\d7\\05\\1d\\631b04f7bf5bb3166c084025d32f01cb5e4a9466021c1f4795\n",
      "Successfully built rexmex\n",
      "Installing collected packages: mpmath, urllib3, typing-extensions, tqdm, tabulate, sympy, pyyaml, protobuf, networkx, mypy-extensions, more-itertools, Mako, greenlet, filelock, colorlog, cmaes, click, class-resolver, charset-normalizer, certifi, typing-inspect, torch, sqlalchemy, requests, more-click, marshmallow, docdata, click-default-group, torch-max-mem, rexmex, pystow, dataclasses-json, alembic, torch-ppr, optuna, pykeen\n",
      "  Running setup.py install for click-default-group: started\n",
      "  Running setup.py install for click-default-group: finished with status 'done'\n",
      "Successfully installed Mako-1.2.4 alembic-1.11.1 certifi-2023.7.22 charset-normalizer-3.2.0 class-resolver-0.4.2 click-8.1.6 click-default-group-1.2.2 cmaes-0.10.0 colorlog-6.7.0 dataclasses-json-0.5.13 docdata-0.0.3 filelock-3.12.2 greenlet-2.0.2 marshmallow-3.20.1 more-click-0.1.2 more-itertools-10.0.0 mpmath-1.3.0 mypy-extensions-1.0.0 networkx-3.1 optuna-3.2.0 protobuf-3.20.3 pykeen-1.10.1 pystow-0.5.0 pyyaml-6.0.1 requests-2.31.0 rexmex-0.1.3 sqlalchemy-2.0.19 sympy-1.12 tabulate-0.9.0 torch-2.0.1 torch-max-mem-0.0.5 torch-ppr-0.0.8 tqdm-4.65.0 typing-extensions-4.7.1 typing-inspect-0.9.0 urllib3-2.0.4\n"
     ]
    }
   ],
   "source": [
    "#pip install pykeen"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2692c5a9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Using cached neo4j-5.10.0.tar.gz (187 kB)\n",
      "  Installing build dependencies: started\n",
      "  Installing build dependencies: finished with status 'done'\n",
      "  Getting requirements to build wheel: started\n",
      "  Getting requirements to build wheel: finished with status 'done'\n",
      "  Installing backend dependencies: started\n",
      "  Installing backend dependencies: finished with status 'done'\n",
      "  Preparing metadata (pyproject.toml): started\n",
      "  Preparing metadata (pyproject.toml): finished with status 'done'\n",
      "Requirement already satisfied: pytz in c:\\users\\bless\\appdata\\local\\programs\\python\\python311\\lib\\site-packages (from neo4j) (2023.3)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (pyproject.toml): started\n",
      "  Building wheel for neo4j (pyproject.toml): finished with status 'done'\n",
      "  Created wheel for neo4j: filename=neo4j-5.10.0-py3-none-any.whl size=259319 sha256=b740b0fe46126aee64cd0c704d4282187a28a137d7612113701b4297ce6097a5\n",
      "  Stored in directory: c:\\users\\bless\\appdata\\local\\pip\\cache\\wheels\\15\\e7\\63\\91fd6c4e68d0a4cd8d3aaf55f181f978488158ca3bdd5bbcb7\n",
      "Successfully built neo4j\n",
      "Installing collected packages: neo4j\n",
      "Successfully installed neo4j-5.10.0\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n",
      "[notice] A new release of pip available: 22.3 -> 23.2.1\n",
      "[notice] To update, run: C:\\Users\\bless\\AppData\\Local\\Programs\\Python\\Python311\\python.exe -m pip install --upgrade pip\n"
     ]
    }
   ],
   "source": [
    "#pip install neo4j\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "db9c9449",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "4f00428d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# from pykeen.pipeline import pipeline\n",
    "\n",
    "# result = pipeline(\n",
    "#     model='TransE',\n",
    "#     dataset='nations',\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "3d2b5b61",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define Neo4j connections\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "\n",
    "host = 'bolt://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = '12345678'\n",
    "database = 'hetionet1'\n",
    "driver = GraphDatabase.driver(host,auth=(user, password), database = database)\n",
    "                                         \n",
    "\n",
    "def run_query(query, params={}):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params)\n",
    "        return pd.DataFrame([r.values() for r in result], columns=result.keys())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "6a8e1069",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = run_query(\"\"\"\n",
    "match (s)-[r]->(t) return toString(id(s)) as source, toString(id(t)) as target, type(r) as type\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "04b6293e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>target</th>\n",
       "      <th>type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>12590</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0</td>\n",
       "      <td>8752</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>7915</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>21711</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0</td>\n",
       "      <td>6447</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  source target       type\n",
       "0      0  12590  interacts\n",
       "1      0   8752  interacts\n",
       "2      0   7915  interacts\n",
       "3      0  21711  interacts\n",
       "4      0   6447  interacts"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "72c324ec",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "0eacd875",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: pykeen in c:\\users\\bless\\anaconda3\\lib\\site-packages (1.10.1)\n",
      "Requirement already satisfied: tqdm in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (4.64.1)\n",
      "Requirement already satisfied: typing-extensions in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (4.4.0)\n",
      "Requirement already satisfied: rexmex>=0.1.3 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.1.3)\n",
      "Requirement already satisfied: requests in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (2.28.1)\n",
      "Requirement already satisfied: protobuf<4.0.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (3.20.3)\n",
      "Requirement already satisfied: torch-ppr>=0.0.7 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.0.8)\n",
      "Requirement already satisfied: scikit-learn in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (1.2.1)\n",
      "Requirement already satisfied: pystow>=0.4.3 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.5.0)\n",
      "Requirement already satisfied: scipy>=1.7.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (1.10.0)\n",
      "Requirement already satisfied: docdata in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.0.3)\n",
      "Requirement already satisfied: dataclasses-json in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.5.13)\n",
      "Requirement already satisfied: torch-max-mem>=0.0.4 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.0.5)\n",
      "Requirement already satisfied: tabulate in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.8.10)\n",
      "Requirement already satisfied: class-resolver>=0.3.10 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.4.2)\n",
      "Requirement already satisfied: click in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (8.0.4)\n",
      "Requirement already satisfied: pyyaml in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (6.0)\n",
      "Requirement already satisfied: click-default-group in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (1.2.2)\n",
      "Requirement already satisfied: pandas>=1.0.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (1.5.3)\n",
      "Requirement already satisfied: more-itertools in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (10.0.0)\n",
      "Requirement already satisfied: numpy in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (1.23.5)\n",
      "Requirement already satisfied: more-click in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (0.1.2)\n",
      "Requirement already satisfied: optuna>=2.0.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pykeen) (3.2.0)\n",
      "Requirement already satisfied: cmaes>=0.9.1 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from optuna>=2.0.0->pykeen) (0.10.0)\n",
      "Requirement already satisfied: packaging>=20.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from optuna>=2.0.0->pykeen) (22.0)\n",
      "Requirement already satisfied: alembic>=1.5.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from optuna>=2.0.0->pykeen) (1.11.1)\n",
      "Requirement already satisfied: colorlog in c:\\users\\bless\\anaconda3\\lib\\site-packages (from optuna>=2.0.0->pykeen) (6.7.0)\n",
      "Requirement already satisfied: sqlalchemy>=1.3.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from optuna>=2.0.0->pykeen) (1.4.39)\n",
      "Requirement already satisfied: pytz>=2020.1 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pandas>=1.0.0->pykeen) (2022.7)\n",
      "Requirement already satisfied: python-dateutil>=2.8.1 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from pandas>=1.0.0->pykeen) (2.8.2)\n",
      "Requirement already satisfied: torch>=2.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from torch-max-mem>=0.0.4->pykeen) (2.0.1)\n",
      "Requirement already satisfied: colorama in c:\\users\\bless\\anaconda3\\lib\\site-packages (from click->pykeen) (0.4.6)\n",
      "Requirement already satisfied: typing-inspect<1,>=0.4.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from dataclasses-json->pykeen) (0.9.0)\n",
      "Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from dataclasses-json->pykeen) (3.20.1)\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from requests->pykeen) (3.4)\n",
      "Requirement already satisfied: charset-normalizer<3,>=2 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from requests->pykeen) (2.0.4)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from requests->pykeen) (2023.5.7)\n",
      "Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from requests->pykeen) (1.26.14)\n",
      "Requirement already satisfied: threadpoolctl>=2.0.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from scikit-learn->pykeen) (2.2.0)\n",
      "Requirement already satisfied: joblib>=1.1.1 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from scikit-learn->pykeen) (1.1.1)\n",
      "Requirement already satisfied: Mako in c:\\users\\bless\\anaconda3\\lib\\site-packages (from alembic>=1.5.0->optuna>=2.0.0->pykeen) (1.2.4)\n",
      "Requirement already satisfied: six>=1.5 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from python-dateutil>=2.8.1->pandas>=1.0.0->pykeen) (1.16.0)\n",
      "Requirement already satisfied: greenlet!=0.4.17 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from sqlalchemy>=1.3.0->optuna>=2.0.0->pykeen) (2.0.1)\n",
      "Requirement already satisfied: filelock in c:\\users\\bless\\anaconda3\\lib\\site-packages (from torch>=2.0->torch-max-mem>=0.0.4->pykeen) (3.9.0)\n",
      "Requirement already satisfied: jinja2 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from torch>=2.0->torch-max-mem>=0.0.4->pykeen) (3.1.2)\n",
      "Requirement already satisfied: sympy in c:\\users\\bless\\anaconda3\\lib\\site-packages (from torch>=2.0->torch-max-mem>=0.0.4->pykeen) (1.11.1)\n",
      "Requirement already satisfied: networkx in c:\\users\\bless\\anaconda3\\lib\\site-packages (from torch>=2.0->torch-max-mem>=0.0.4->pykeen) (2.8.4)\n",
      "Requirement already satisfied: mypy-extensions>=0.3.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from typing-inspect<1,>=0.4.0->dataclasses-json->pykeen) (0.4.3)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from jinja2->torch>=2.0->torch-max-mem>=0.0.4->pykeen) (2.1.1)\n",
      "Requirement already satisfied: mpmath>=0.19 in c:\\users\\bless\\anaconda3\\lib\\site-packages (from sympy->torch>=2.0->torch-max-mem>=0.0.4->pykeen) (1.2.1)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "#pip install --upgrade pykeen\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "af01f453",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pykeen.triples import TriplesFactory\n",
    "\n",
    "\n",
    "tf = TriplesFactory.from_labeled_triples(\n",
    "  data[[\"source\", \"type\", \"target\"]].values,\n",
    "  create_inverse_triples=False,\n",
    "  entity_to_id=None,\n",
    "  relation_to_id=None,\n",
    "  compact_id=False,\n",
    "  filter_out_candidate_inverse_relations=True,\n",
    "  metadata=None,\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "91e2f846",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=561721)"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tf"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "b3319ffc",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:pykeen.utils:using automatically assigned random_state=1241804504\n",
      "INFO:pykeen.triples.splitting:done splitting triples to groups of sizes [374117, 112344, 56173]\n"
     ]
    }
   ],
   "source": [
    "training, testing, validation = tf.split([.7, .2, .1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "11f4d439",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204)"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "training"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "503c18df",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=112344)"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "testing"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "8bab71c0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=56173)"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "validation"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "edd7703c",
   "metadata": {},
   "source": [
    "# Running QuatE and ProjE model on the Hetionet data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "9ce26c1e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.pipeline.api:Using device: cpu\n",
      "INFO:pykeen.stoppers.early_stopping:Inferred checkpoint path for best model weights: C:\\Users\\bless\\.data\\pykeen\\checkpoints\\best-model-weights-1fb69115-4b07-494f-8797-d97bbe1bd261.pt\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "308cb821b37f4e24b25967d844a744c1",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training epochs on cpu:   0%|          | 0/3 [00:00<?, ?epoch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1536 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1536 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1536 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Currently automatic memory optimization only supports GPUs, but you're using a CPU. Therefore, the batch_size will be set to the default value.\n",
      "INFO:pykeen.evaluation.evaluator:No evaluation batch_size provided. Setting batch_size to '32'.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "aecbb2ca144a45ddaf331d9eee1b021e",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating on cpu:   0%|          | 0.00/112k [00:00<?, ?triple/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Evaluation took 9005.15s seconds\n",
      "INFO:pykeen.pipeline.api:Using device: cpu\n",
      "INFO:pykeen.stoppers.early_stopping:Inferred checkpoint path for best model weights: C:\\Users\\bless\\.data\\pykeen\\checkpoints\\best-model-weights-04e1e5c8-0559-43cc-9ced-d99141d14063.pt\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PipelineResult(random_seed=420, model=QuatE(\n",
      "  (loss): MarginRankingLoss(\n",
      "    (margin_activation): ReLU()\n",
      "  )\n",
      "  (interaction): QuatEInteraction()\n",
      "  (entity_representations): ModuleList(\n",
      "    (0): Embedding(\n",
      "      (regularizer): LpRegularizer()\n",
      "      (_embeddings): Embedding(19930, 400)\n",
      "    )\n",
      "  )\n",
      "  (relation_representations): ModuleList(\n",
      "    (0): Embedding(\n",
      "      (regularizer): LpRegularizer()\n",
      "      (_embeddings): Embedding(10, 400)\n",
      "    )\n",
      "  )\n",
      "  (weight_regularizers): ModuleList()\n",
      "), training=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), training_loop=<pykeen.training.slcwa.SLCWATrainingLoop object at 0x000001B7A8E90550>, losses=[0.6240022398026971, 0.27454931514997344, 0.18387955038148598], metric_results=<pykeen.evaluation.rank_based_evaluator.RankBasedMetricResults object at 0x000001B7AFE92950>, train_seconds=379.334023475647, evaluate_seconds=9005.172942638397, stopper=EarlyStopper(evaluator=<pykeen.evaluation.rank_based_evaluator.RankBasedEvaluator object at 0x000001B7A8DF6B30>, training_triples_factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), evaluation_triples_factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=56173), evaluation_batch_size=None, evaluation_slice_size=None, frequency=10, patience=2, metric='hits_at_k', relative_delta=0.01, larger_is_better=True, result_tracker=<pykeen.trackers.base.MultiResultTracker object at 0x000001B79C453CA0>, stopped=False, best_model_path=WindowsPath('C:/Users/bless/.data/pykeen/checkpoints/best-model-weights-1fb69115-4b07-494f-8797-d97bbe1bd261.pt'), clean_up_checkpoint=True), configuration={'dataset': '<user defined>', 'training': '<user defined>', 'testing': '<user defined>', 'validation': '<user defined>', 'model': 'QuatE', 'model_kwargs': {'random_seed': 420, 'loss': MarginRankingLoss(\n",
      "  (margin_activation): ReLU()\n",
      "), 'embedding_dim': 100, 'entity_initializer': <function init_quaternions at 0x000001B7A6C693F0>, 'entity_regularizer': <class 'pykeen.regularizers.LpRegularizer'>, 'entity_regularizer_kwargs': None, 'relation_initializer': <function init_quaternions at 0x000001B7A6C693F0>, 'relation_regularizer': <class 'pykeen.regularizers.LpRegularizer'>, 'relation_regularizer_kwargs': None, 'relation_normalizer': <function quaternion_normalizer at 0x000001B7A6DAB7F0>}, 'loss_kwargs': None, 'regularizer_kwargs': None, 'optimizer': 'Adam', 'optimizer_kwargs': {'lr': 0.001, 'betas': (0.9, 0.999), 'eps': 1e-08, 'weight_decay': 0, 'amsgrad': False, 'maximize': False, 'foreach': None, 'capturable': False, 'differentiable': False, 'fused': None}, 'training_loop': 'SLCWATrainingLoop', 'training_loop_kwargs': {}, 'evaluator': 'RankBasedEvaluator', 'evaluator_kwargs': {}, 'num_epochs': 3, 'batch_size': 256, 'evaluation_kwargs': {'additional_filter_triples': {'training': {'sha512': 'e7cb705a61a9ccb0b985c95e1bc7e009c978dc9aa48adf6f2689a06230f47e86d8ddbbe6a54dc1413c0bfc692ac7adb7c4e0f97a837eb11292ca83ad279ead91'}, 'validation': {'sha512': 'f3fb0c00a141fabf8a2d2878010eba1568e5efc56c43a34250c916c42f5fc0000a496a592bc6d4578d90c2888271e97a4730cefa0b4edadf6d10c46626a93fc7'}}}}, metadata={}, version='1.10.1', git_hash='UNHASHED')\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "213bece883a049898916697b8eb318b1",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training epochs on cpu:   0%|          | 0/3 [00:00<?, ?epoch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1536 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1536 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1536 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Currently automatic memory optimization only supports GPUs, but you're using a CPU. Therefore, the batch_size will be set to the default value.\n",
      "INFO:pykeen.evaluation.evaluator:No evaluation batch_size provided. Setting batch_size to '32'.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "779f84f7c76644669a7c63fe632363b1",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating on cpu:   0%|          | 0.00/112k [00:00<?, ?triple/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Evaluation took 387.98s seconds\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PipelineResult(random_seed=420, model=QuatE(\n",
      "  (loss): MarginRankingLoss(\n",
      "    (margin_activation): ReLU()\n",
      "  )\n",
      "  (interaction): QuatEInteraction()\n",
      "  (entity_representations): ModuleList(\n",
      "    (0): Embedding(\n",
      "      (regularizer): LpRegularizer()\n",
      "      (_embeddings): Embedding(19930, 400)\n",
      "    )\n",
      "  )\n",
      "  (relation_representations): ModuleList(\n",
      "    (0): Embedding(\n",
      "      (regularizer): LpRegularizer()\n",
      "      (_embeddings): Embedding(10, 400)\n",
      "    )\n",
      "  )\n",
      "  (weight_regularizers): ModuleList()\n",
      "), training=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), training_loop=<pykeen.training.slcwa.SLCWATrainingLoop object at 0x000001B7A8E90550>, losses=[0.6240022398026971, 0.27454931514997344, 0.18387955038148598], metric_results=<pykeen.evaluation.rank_based_evaluator.RankBasedMetricResults object at 0x000001B7AFE92950>, train_seconds=379.334023475647, evaluate_seconds=9005.172942638397, stopper=EarlyStopper(evaluator=<pykeen.evaluation.rank_based_evaluator.RankBasedEvaluator object at 0x000001B7A8DF6B30>, training_triples_factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), evaluation_triples_factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=56173), evaluation_batch_size=None, evaluation_slice_size=None, frequency=10, patience=2, metric='hits_at_k', relative_delta=0.01, larger_is_better=True, result_tracker=<pykeen.trackers.base.MultiResultTracker object at 0x000001B79C453CA0>, stopped=False, best_model_path=WindowsPath('C:/Users/bless/.data/pykeen/checkpoints/best-model-weights-1fb69115-4b07-494f-8797-d97bbe1bd261.pt'), clean_up_checkpoint=True), configuration={'dataset': '<user defined>', 'training': '<user defined>', 'testing': '<user defined>', 'validation': '<user defined>', 'model': 'QuatE', 'model_kwargs': {'random_seed': 420, 'loss': MarginRankingLoss(\n",
      "  (margin_activation): ReLU()\n",
      "), 'embedding_dim': 100, 'entity_initializer': <function init_quaternions at 0x000001B7A6C693F0>, 'entity_regularizer': <class 'pykeen.regularizers.LpRegularizer'>, 'entity_regularizer_kwargs': None, 'relation_initializer': <function init_quaternions at 0x000001B7A6C693F0>, 'relation_regularizer': <class 'pykeen.regularizers.LpRegularizer'>, 'relation_regularizer_kwargs': None, 'relation_normalizer': <function quaternion_normalizer at 0x000001B7A6DAB7F0>}, 'loss_kwargs': None, 'regularizer_kwargs': None, 'optimizer': 'Adam', 'optimizer_kwargs': {'lr': 0.001, 'betas': (0.9, 0.999), 'eps': 1e-08, 'weight_decay': 0, 'amsgrad': False, 'maximize': False, 'foreach': None, 'capturable': False, 'differentiable': False, 'fused': None}, 'training_loop': 'SLCWATrainingLoop', 'training_loop_kwargs': {}, 'evaluator': 'RankBasedEvaluator', 'evaluator_kwargs': {}, 'num_epochs': 3, 'batch_size': 256, 'evaluation_kwargs': {'additional_filter_triples': {'training': {'sha512': 'e7cb705a61a9ccb0b985c95e1bc7e009c978dc9aa48adf6f2689a06230f47e86d8ddbbe6a54dc1413c0bfc692ac7adb7c4e0f97a837eb11292ca83ad279ead91'}, 'validation': {'sha512': 'f3fb0c00a141fabf8a2d2878010eba1568e5efc56c43a34250c916c42f5fc0000a496a592bc6d4578d90c2888271e97a4730cefa0b4edadf6d10c46626a93fc7'}}}}, metadata={}, version='1.10.1', git_hash='UNHASHED')\n"
     ]
    }
   ],
   "source": [
    "from pykeen.pipeline import pipeline\n",
    "import torch\n",
    "\n",
    "# Assuming you already have the necessary imports and data loaded\n",
    "\n",
    "# Set the device to 'cuda' if a GPU is available, otherwise use 'cpu'\n",
    "device = torch.device('cuda' if torch.cuda.is_available() else 'cpu')\n",
    "\n",
    "# Create the pipeline with the desired model and other settings\n",
    "result = pipeline(\n",
    "    training=training,\n",
    "    testing=testing,\n",
    "    validation=validation,\n",
    "    model='QuatE',\n",
    "    stopper='early',\n",
    "    epochs=3,\n",
    "    dimensions=512,\n",
    "    random_seed=420,\n",
    "    device=device,  # Set the device to use the GPU\n",
    ")\n",
    "\n",
    "# Print the result or perform other operations with the model and result\n",
    "print(result)\n",
    "\n",
    "\n",
    "# Create the pipeline with the desired model and other settings\n",
    "result1 = pipeline(\n",
    "    training=training,\n",
    "    testing=testing,\n",
    "    validation=validation,\n",
    "    model='ProjE',\n",
    "    stopper='early',\n",
    "    epochs=3,\n",
    "    dimensions=512,\n",
    "    random_seed=420,\n",
    "    device=device,  # Set the device to use the GPU\n",
    ")\n",
    "\n",
    "# Print the result or perform other operations with the model and result\n",
    "print(result)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "id": "52fffc73",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.triples.triples_factory:Stored TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204) to file:///C:/Users/bless/OneDrive/MS_Studies/AML/NEO4J/CODE/QuatE_results/training_triples\n",
      "INFO:pykeen.pipeline.api:Saved to directory: file:///C:/Users/bless/OneDrive/MS_Studies/AML/NEO4J/CODE/QuatE_results\n",
      "INFO:pykeen.triples.triples_factory:Stored TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204) to file:///C:/Users/bless/OneDrive/MS_Studies/AML/NEO4J/CODE/ProjE_results/training_triples\n",
      "INFO:pykeen.pipeline.api:Saved to directory: file:///C:/Users/bless/OneDrive/MS_Studies/AML/NEO4J/CODE/ProjE_results\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PipelineResult(random_seed=420, model=ProjE(\n",
      "  (loss): MarginRankingLoss(\n",
      "    (margin_activation): ReLU()\n",
      "  )\n",
      "  (interaction): ProjEInteraction(\n",
      "    (inner_non_linearity): Tanh()\n",
      "  )\n",
      "  (entity_representations): ModuleList(\n",
      "    (0): Embedding(\n",
      "      (_embeddings): Embedding(19930, 50)\n",
      "    )\n",
      "  )\n",
      "  (relation_representations): ModuleList(\n",
      "    (0): Embedding(\n",
      "      (_embeddings): Embedding(10, 50)\n",
      "    )\n",
      "  )\n",
      "  (weight_regularizers): ModuleList()\n",
      "), training=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), training_loop=<pykeen.training.slcwa.SLCWATrainingLoop object at 0x000001B7A8E923B0>, losses=[0.7512686726792405, 0.5438912059568489, 0.42557954918205115], metric_results=<pykeen.evaluation.rank_based_evaluator.RankBasedMetricResults object at 0x000001B7AFE5CCD0>, train_seconds=50.35933756828308, evaluate_seconds=387.988242149353, stopper=EarlyStopper(evaluator=<pykeen.evaluation.rank_based_evaluator.RankBasedEvaluator object at 0x000001B7A6E253C0>, training_triples_factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), evaluation_triples_factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=56173), evaluation_batch_size=None, evaluation_slice_size=None, frequency=10, patience=2, metric='hits_at_k', relative_delta=0.01, larger_is_better=True, result_tracker=<pykeen.trackers.base.MultiResultTracker object at 0x000001B79B2BDFF0>, stopped=False, best_model_path=WindowsPath('C:/Users/bless/.data/pykeen/checkpoints/best-model-weights-04e1e5c8-0559-43cc-9ced-d99141d14063.pt'), clean_up_checkpoint=True), configuration={'dataset': '<user defined>', 'training': '<user defined>', 'testing': '<user defined>', 'validation': '<user defined>', 'model': 'ProjE', 'model_kwargs': {'random_seed': 420, 'loss': MarginRankingLoss(\n",
      "  (margin_activation): ReLU()\n",
      "), 'embedding_dim': 50, 'inner_non_linearity': None, 'entity_initializer': <function xavier_uniform_ at 0x000001B7A6C11EA0>, 'relation_initializer': <function xavier_uniform_ at 0x000001B7A6C11EA0>}, 'loss_kwargs': None, 'regularizer_kwargs': None, 'optimizer': 'Adam', 'optimizer_kwargs': {'lr': 0.001, 'betas': (0.9, 0.999), 'eps': 1e-08, 'weight_decay': 0, 'amsgrad': False, 'maximize': False, 'foreach': None, 'capturable': False, 'differentiable': False, 'fused': None}, 'training_loop': 'SLCWATrainingLoop', 'training_loop_kwargs': {}, 'evaluator': 'RankBasedEvaluator', 'evaluator_kwargs': {}, 'num_epochs': 3, 'batch_size': 256, 'evaluation_kwargs': {'additional_filter_triples': {'training': {'sha512': 'e7cb705a61a9ccb0b985c95e1bc7e009c978dc9aa48adf6f2689a06230f47e86d8ddbbe6a54dc1413c0bfc692ac7adb7c4e0f97a837eb11292ca83ad279ead91'}, 'validation': {'sha512': 'f3fb0c00a141fabf8a2d2878010eba1568e5efc56c43a34250c916c42f5fc0000a496a592bc6d4578d90c2888271e97a4730cefa0b4edadf6d10c46626a93fc7'}}}}, metadata={}, version='1.10.1', git_hash='UNHASHED')\n"
     ]
    }
   ],
   "source": [
    "result.save_to_directory('QuatE_results')\n",
    "result1.save_to_directory('ProjE_results')\n",
    "print(result1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "05c6bd01",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: torch in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (2.0.1)\n",
      "Requirement already satisfied: torchvision in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (0.15.2)\n",
      "Requirement already satisfied: filelock in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torch) (3.9.0)\n",
      "Requirement already satisfied: typing-extensions in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torch) (4.7.1)\n",
      "Requirement already satisfied: sympy in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torch) (1.11.1)\n",
      "Requirement already satisfied: networkx in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torch) (2.8.4)\n",
      "Requirement already satisfied: jinja2 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torch) (3.1.2)\n",
      "Requirement already satisfied: numpy in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torchvision) (1.24.3)\n",
      "Requirement already satisfied: requests in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torchvision) (2.31.0)\n",
      "Requirement already satisfied: pillow!=8.3.*,>=5.3.0 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from torchvision) (9.4.0)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from jinja2->torch) (2.1.1)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from requests->torchvision) (2.0.4)\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from requests->torchvision) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from requests->torchvision) (1.26.16)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from requests->torchvision) (2023.7.22)\n",
      "Requirement already satisfied: mpmath>=0.19 in c:\\users\\bless\\anaconda3\\envs\\cuda_env\\lib\\site-packages (from sympy->torch) (1.2.1)\n"
     ]
    }
   ],
   "source": [
    "# !pip install torch torchvision\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d351c73c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "cpu\n",
      "Pytorch CUDA Version is  None\n"
     ]
    }
   ],
   "source": [
    "# import torch\n",
    "\n",
    "# device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n",
    "# print(device)  # Check if it outputs 'cuda' if GPU is available, or 'cpu' if not.\n",
    "\n",
    "# # Additional code using the device (e.g., moving tensors to GPU)\n",
    "# # Importing Pytorch\n",
    "# # To print Cuda version\n",
    "# print(\"Pytorch CUDA Version is \", torch.version.cuda)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "902bcb0f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Using device: cpu\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# # setting device on GPU if available, else CPU\n",
    "# device = torch.device('cuda' if torch.cuda.is_available() else 'cpu')\n",
    "# print('Using device:', device)\n",
    "# print()\n",
    "\n",
    "# #Additional Info when using cuda\n",
    "# if device.type == 'cuda':\n",
    "#     print(torch.cuda.get_device_name(0))\n",
    "#     print('Memory Usage:')\n",
    "#     print('Allocated:', round(torch.cuda.memory_allocated(0)/1024**3,1), 'GB')\n",
    "#     print('Cached:   ', round(torch.cuda.memory_reserved(0)/1024**3,1), 'GB')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9f15d4b",
   "metadata": {},
   "source": [
    "# Usecase1: Prediction of Upregulated genes in Breast Cancer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 248,
   "id": "671781cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'3099'"
      ]
     },
     "execution_count": 248,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#from pykeen import predict\n",
    "from pykeen.predict import predict_target\n",
    "compound_id = run_query(\"\"\"\n",
    "MATCH (s:Disease)\n",
    "WHERE s.name = \"breast cancer\"\n",
    "RETURN toString(id(s)) as id\n",
    "\"\"\")['id'][0]\n",
    "\n",
    "compound_id\n",
    "\n",
    "#df\n",
    "#df['in_training']"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "18d65110",
   "metadata": {},
   "source": [
    "### Analysis using QuatE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 249,
   "id": "e9418fd7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TargetPredictions(df=       tail_id     score tail_label\n",
      "5398      5398  3.324914      15544\n",
      "15816    15816  3.171596       5812\n",
      "918        918  3.019877      10948\n",
      "1146      1146  3.018856      11183\n",
      "5228      5228  2.867625      15371\n",
      "...        ...       ...        ...\n",
      "10822    10822 -2.560827      21080\n",
      "968        968 -2.589779        110\n",
      "11547    11547 -2.703009      21814\n",
      "13167    13167 -2.710057       3099\n",
      "12987    12987 -2.876242       2912\n",
      "\n",
      "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))\n"
     ]
    }
   ],
   "source": [
    "df = predict_target(model=result.model,\n",
    "                    head=compound_id,\n",
    "                    relation='upregulates',\n",
    "                    triples_factory=result.training,)\n",
    "print(df)\n",
    "#what is df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1779a75e",
   "metadata": {},
   "source": [
    "### Analysis using ProjE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 250,
   "id": "3d6f70e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TargetPredictions(df=       tail_id     score tail_label\n",
      "9817      9817  4.429758      20057\n",
      "2056      2056  4.248618        121\n",
      "7566      7566  4.181810      17758\n",
      "3266      3266  4.173839       1336\n",
      "5504      5504  4.171958      15651\n",
      "...        ...       ...        ...\n",
      "19316    19316 -3.103631       9373\n",
      "8919      8919 -3.104685      19147\n",
      "16139    16139 -3.108089       6148\n",
      "1763      1763 -3.174391      11811\n",
      "8948      8948 -3.192385      19177\n",
      "\n",
      "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))\n"
     ]
    }
   ],
   "source": [
    "df1 = predict_target(model=result1.model,\n",
    "                    head=compound_id,\n",
    "                    relation='upregulates',\n",
    "                    triples_factory=result1.training,)\n",
    "print(df1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9d4cac4",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 251,
   "id": "a2443069",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'3099'"
      ]
     },
     "execution_count": 251,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "compound_id"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 252,
   "id": "479afb45",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred_filtered = df.filter_triples(training)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "id": "f458e1da",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id     score tail_label\n",
       "15816    15816  3.171596       5812\n",
       "11515    11515  2.790679      21782\n",
       "12568    12568  2.772505       2480\n",
       "7771      7771  2.731557      17966\n",
       "8041      8041  2.725287      18240\n",
       "...        ...       ...        ...\n",
       "10822    10822 -2.560827      21080\n",
       "968        968 -2.589779        110\n",
       "11547    11547 -2.703009      21814\n",
       "13167    13167 -2.710057       3099\n",
       "12987    12987 -2.876242       2912\n",
       "\n",
       "[19756 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 254,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 255,
   "id": "21d23f6f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id     score tail_label\n",
       "9817      9817  4.429758      20057\n",
       "2056      2056  4.248618        121\n",
       "7566      7566  4.181810      17758\n",
       "5504      5504  4.171958      15651\n",
       "11332    11332  4.161258      21599\n",
       "...        ...       ...        ...\n",
       "19316    19316 -3.103631       9373\n",
       "8919      8919 -3.104685      19147\n",
       "16139    16139 -3.108089       6148\n",
       "1763      1763 -3.174391      11811\n",
       "8948      8948 -3.192385      19177\n",
       "\n",
       "[19756 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 255,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered1 = df1.filter_triples(training)\n",
    "pred_filtered1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 257,
   "id": "066a098b",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred_annotated = pred_filtered.add_membership_columns(validation=validation, testing=testing, training=training)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 258,
   "id": "45e2e7f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred_annotated1 = pred_filtered1.add_membership_columns(validation=validation, testing=testing, training=training)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 259,
   "id": "ba42179f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id     score tail_label  in_validation  in_testing  in_training\n",
       "15816    15816  3.171596       5812          False       False        False\n",
       "11515    11515  2.790679      21782          False       False        False\n",
       "12568    12568  2.772505       2480           True       False        False\n",
       "7771      7771  2.731557      17966          False       False        False\n",
       "8041      8041  2.725287      18240          False       False        False\n",
       "...        ...       ...        ...            ...         ...          ...\n",
       "10822    10822 -2.560827      21080          False       False        False\n",
       "968        968 -2.589779        110          False       False        False\n",
       "11547    11547 -2.703009      21814          False       False        False\n",
       "13167    13167 -2.710057       3099          False       False        False\n",
       "12987    12987 -2.876242       2912          False       False        False\n",
       "\n",
       "[19756 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 259,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 260,
   "id": "9bbd8f52",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id     score tail_label  in_validation  in_testing  in_training\n",
       "9817      9817  4.429758      20057          False       False        False\n",
       "2056      2056  4.248618        121          False       False        False\n",
       "7566      7566  4.181810      17758          False       False        False\n",
       "5504      5504  4.171958      15651          False       False        False\n",
       "11332    11332  4.161258      21599          False       False        False\n",
       "...        ...       ...        ...            ...         ...          ...\n",
       "19316    19316 -3.103631       9373          False       False        False\n",
       "8919      8919 -3.104685      19147          False       False        False\n",
       "16139    16139 -3.108089       6148          False       False        False\n",
       "1763      1763 -3.174391      11811          False       False        False\n",
       "8948      8948 -3.192385      19177          False       False        False\n",
       "\n",
       "[19756 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 260,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 261,
   "id": "4cb7481a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id     score tail_label\n",
       "5398      5398  3.324914      15544\n",
       "15816    15816  3.171596       5812\n",
       "918        918  3.019877      10948\n",
       "1146      1146  3.018856      11183\n",
       "5228      5228  2.867625      15371\n",
       "...        ...       ...        ...\n",
       "10822    10822 -2.560827      21080\n",
       "968        968 -2.589779        110\n",
       "11547    11547 -2.703009      21814\n",
       "13167    13167 -2.710057       3099\n",
       "12987    12987 -2.876242       2912\n",
       "\n",
       "[19883 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 261,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.filter_triples(testing)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 262,
   "id": "be2476bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id     score tail_label\n",
       "9817      9817  4.429758      20057\n",
       "2056      2056  4.248618        121\n",
       "7566      7566  4.181810      17758\n",
       "3266      3266  4.173839       1336\n",
       "5504      5504  4.171958      15651\n",
       "...        ...       ...        ...\n",
       "19316    19316 -3.103631       9373\n",
       "8919      8919 -3.104685      19147\n",
       "16139    16139 -3.108089       6148\n",
       "1763      1763 -3.174391      11811\n",
       "8948      8948 -3.192385      19177\n",
       "\n",
       "[19883 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 262,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df1.filter_triples(testing)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e5ab897",
   "metadata": {},
   "source": [
    "# Prediction results for QuatE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "22f13ccc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "      tail_label  tail_predict tail_label  in_training\n",
      "3755        3755     -3.131956      CREB1        False\n",
      "5059        5059     -3.163479       E2F1        False\n",
      "13047      13047     -3.167017      POLD1        False\n",
      "15879      15879     -3.170648      SMAD3        False\n",
      "9906        9906     -3.172402     MAPK14        False\n"
     ]
    }
   ],
   "source": [
    "# in_training = [tail_id in result.training.entity_to_id for tail_id in df['tail_id']]\n",
    "\n",
    "# # Add the 'in_training' column to the DataFrame\n",
    "# df['in_training'] = in_training\n",
    "\n",
    "# # Rename the columns to match your desired output\n",
    "# df = df.rename(columns={'tail_id': 'tail_label', 'score': 'tail_predict'})\n",
    "\n",
    "# # Print the DataFrame\n",
    "# print(df.head(5))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 265,
   "id": "71a14c27",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>tail_id</th>\n",
       "      <th>score</th>\n",
       "      <th>tail_label</th>\n",
       "      <th>in_validation</th>\n",
       "      <th>in_testing</th>\n",
       "      <th>in_training</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>15816</th>\n",
       "      <td>15816</td>\n",
       "      <td>3.171596</td>\n",
       "      <td>5812</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11515</th>\n",
       "      <td>11515</td>\n",
       "      <td>2.790679</td>\n",
       "      <td>21782</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12568</th>\n",
       "      <td>12568</td>\n",
       "      <td>2.772505</td>\n",
       "      <td>2480</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7771</th>\n",
       "      <td>7771</td>\n",
       "      <td>2.731557</td>\n",
       "      <td>17966</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8041</th>\n",
       "      <td>8041</td>\n",
       "      <td>2.725287</td>\n",
       "      <td>18240</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14831</th>\n",
       "      <td>14831</td>\n",
       "      <td>2.670315</td>\n",
       "      <td>4803</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18684</th>\n",
       "      <td>18684</td>\n",
       "      <td>2.670084</td>\n",
       "      <td>8737</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14855</th>\n",
       "      <td>14855</td>\n",
       "      <td>2.666677</td>\n",
       "      <td>4827</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18837</th>\n",
       "      <td>18837</td>\n",
       "      <td>2.663634</td>\n",
       "      <td>8889</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7566</th>\n",
       "      <td>7566</td>\n",
       "      <td>2.660922</td>\n",
       "      <td>17758</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18441</th>\n",
       "      <td>18441</td>\n",
       "      <td>2.627832</td>\n",
       "      <td>8487</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8241</th>\n",
       "      <td>8241</td>\n",
       "      <td>2.589904</td>\n",
       "      <td>18450</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3636</th>\n",
       "      <td>3636</td>\n",
       "      <td>2.576888</td>\n",
       "      <td>13744</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13507</th>\n",
       "      <td>13507</td>\n",
       "      <td>2.555472</td>\n",
       "      <td>345</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5107</th>\n",
       "      <td>5107</td>\n",
       "      <td>2.554151</td>\n",
       "      <td>15244</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1048</th>\n",
       "      <td>1048</td>\n",
       "      <td>2.552342</td>\n",
       "      <td>11083</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16850</th>\n",
       "      <td>16850</td>\n",
       "      <td>2.519478</td>\n",
       "      <td>687</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4045</th>\n",
       "      <td>4045</td>\n",
       "      <td>2.511575</td>\n",
       "      <td>14153</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19763</th>\n",
       "      <td>19763</td>\n",
       "      <td>2.496838</td>\n",
       "      <td>9830</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6495</th>\n",
       "      <td>6495</td>\n",
       "      <td>2.491398</td>\n",
       "      <td>16663</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19789</th>\n",
       "      <td>19789</td>\n",
       "      <td>2.471758</td>\n",
       "      <td>9854</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>506</th>\n",
       "      <td>506</td>\n",
       "      <td>2.462197</td>\n",
       "      <td>10520</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14190</th>\n",
       "      <td>14190</td>\n",
       "      <td>2.455258</td>\n",
       "      <td>415</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>679</th>\n",
       "      <td>679</td>\n",
       "      <td>2.452438</td>\n",
       "      <td>10697</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12337</th>\n",
       "      <td>12337</td>\n",
       "      <td>2.441618</td>\n",
       "      <td>2261</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16078</th>\n",
       "      <td>16078</td>\n",
       "      <td>2.421388</td>\n",
       "      <td>6086</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17219</th>\n",
       "      <td>17219</td>\n",
       "      <td>2.420688</td>\n",
       "      <td>7247</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9897</th>\n",
       "      <td>9897</td>\n",
       "      <td>2.415986</td>\n",
       "      <td>20133</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2984</th>\n",
       "      <td>2984</td>\n",
       "      <td>2.410194</td>\n",
       "      <td>13068</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2042</th>\n",
       "      <td>2042</td>\n",
       "      <td>2.409894</td>\n",
       "      <td>12087</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       tail_id     score tail_label  in_validation  in_testing  in_training\n",
       "15816    15816  3.171596       5812          False       False        False\n",
       "11515    11515  2.790679      21782          False       False        False\n",
       "12568    12568  2.772505       2480           True       False        False\n",
       "7771      7771  2.731557      17966          False       False        False\n",
       "8041      8041  2.725287      18240          False       False        False\n",
       "14831    14831  2.670315       4803          False       False        False\n",
       "18684    18684  2.670084       8737          False       False        False\n",
       "14855    14855  2.666677       4827          False        True        False\n",
       "18837    18837  2.663634       8889          False       False        False\n",
       "7566      7566  2.660922      17758          False       False        False\n",
       "18441    18441  2.627832       8487          False       False        False\n",
       "8241      8241  2.589904      18450          False       False        False\n",
       "3636      3636  2.576888      13744          False       False        False\n",
       "13507    13507  2.555472        345          False        True        False\n",
       "5107      5107  2.554151      15244          False       False        False\n",
       "1048      1048  2.552342      11083          False       False        False\n",
       "16850    16850  2.519478        687          False       False        False\n",
       "4045      4045  2.511575      14153          False       False        False\n",
       "19763    19763  2.496838       9830          False       False        False\n",
       "6495      6495  2.491398      16663          False       False        False\n",
       "19789    19789  2.471758       9854          False        True        False\n",
       "506        506  2.462197      10520          False       False        False\n",
       "14190    14190  2.455258        415          False       False        False\n",
       "679        679  2.452438      10697          False       False        False\n",
       "12337    12337  2.441618       2261          False       False        False\n",
       "16078    16078  2.421388       6086          False       False        False\n",
       "17219    17219  2.420688       7247          False       False        False\n",
       "9897      9897  2.415986      20133          False       False        False\n",
       "2984      2984  2.410194      13068          False       False        False\n",
       "2042      2042  2.409894      12087          False       False        False"
      ]
     },
     "execution_count": 265,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df=pred_annotated.df\n",
    "df.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "21000e3f",
   "metadata": {},
   "source": [
    "# Prediction results for ProjE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 266,
   "id": "ef1d7621",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>tail_id</th>\n",
       "      <th>score</th>\n",
       "      <th>tail_label</th>\n",
       "      <th>in_validation</th>\n",
       "      <th>in_testing</th>\n",
       "      <th>in_training</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>9817</th>\n",
       "      <td>9817</td>\n",
       "      <td>4.429758</td>\n",
       "      <td>20057</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2056</th>\n",
       "      <td>2056</td>\n",
       "      <td>4.248618</td>\n",
       "      <td>121</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7566</th>\n",
       "      <td>7566</td>\n",
       "      <td>4.181810</td>\n",
       "      <td>17758</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5504</th>\n",
       "      <td>5504</td>\n",
       "      <td>4.171958</td>\n",
       "      <td>15651</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11332</th>\n",
       "      <td>11332</td>\n",
       "      <td>4.161258</td>\n",
       "      <td>21599</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11450</th>\n",
       "      <td>11450</td>\n",
       "      <td>4.144822</td>\n",
       "      <td>21714</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13800</th>\n",
       "      <td>13800</td>\n",
       "      <td>4.143008</td>\n",
       "      <td>3747</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11737</th>\n",
       "      <td>11737</td>\n",
       "      <td>4.105857</td>\n",
       "      <td>2200</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17042</th>\n",
       "      <td>17042</td>\n",
       "      <td>4.030718</td>\n",
       "      <td>7072</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11541</th>\n",
       "      <td>11541</td>\n",
       "      <td>4.020617</td>\n",
       "      <td>21807</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14434</th>\n",
       "      <td>14434</td>\n",
       "      <td>4.010728</td>\n",
       "      <td>4400</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15138</th>\n",
       "      <td>15138</td>\n",
       "      <td>3.990831</td>\n",
       "      <td>5112</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13387</th>\n",
       "      <td>13387</td>\n",
       "      <td>3.970656</td>\n",
       "      <td>3329</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15009</th>\n",
       "      <td>15009</td>\n",
       "      <td>3.946043</td>\n",
       "      <td>4985</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1894</th>\n",
       "      <td>1894</td>\n",
       "      <td>3.926674</td>\n",
       "      <td>11941</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10290</th>\n",
       "      <td>10290</td>\n",
       "      <td>3.911465</td>\n",
       "      <td>20533</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2463</th>\n",
       "      <td>2463</td>\n",
       "      <td>3.884903</td>\n",
       "      <td>12529</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15083</th>\n",
       "      <td>15083</td>\n",
       "      <td>3.838665</td>\n",
       "      <td>5055</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19180</th>\n",
       "      <td>19180</td>\n",
       "      <td>3.832723</td>\n",
       "      <td>9231</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3512</th>\n",
       "      <td>3512</td>\n",
       "      <td>3.828612</td>\n",
       "      <td>13615</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7918</th>\n",
       "      <td>7918</td>\n",
       "      <td>3.818866</td>\n",
       "      <td>18112</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18017</th>\n",
       "      <td>18017</td>\n",
       "      <td>3.818447</td>\n",
       "      <td>8061</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2759</th>\n",
       "      <td>2759</td>\n",
       "      <td>3.805835</td>\n",
       "      <td>12835</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11317</th>\n",
       "      <td>11317</td>\n",
       "      <td>3.778868</td>\n",
       "      <td>21582</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1535</th>\n",
       "      <td>1535</td>\n",
       "      <td>3.773711</td>\n",
       "      <td>11579</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13507</th>\n",
       "      <td>13507</td>\n",
       "      <td>3.764307</td>\n",
       "      <td>345</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14210</th>\n",
       "      <td>14210</td>\n",
       "      <td>3.762934</td>\n",
       "      <td>4170</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3563</th>\n",
       "      <td>3563</td>\n",
       "      <td>3.749696</td>\n",
       "      <td>13669</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5641</th>\n",
       "      <td>5641</td>\n",
       "      <td>3.739637</td>\n",
       "      <td>15791</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14791</th>\n",
       "      <td>14791</td>\n",
       "      <td>3.730990</td>\n",
       "      <td>4764</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       tail_id     score tail_label  in_validation  in_testing  in_training\n",
       "9817      9817  4.429758      20057          False       False        False\n",
       "2056      2056  4.248618        121          False       False        False\n",
       "7566      7566  4.181810      17758          False       False        False\n",
       "5504      5504  4.171958      15651          False       False        False\n",
       "11332    11332  4.161258      21599          False       False        False\n",
       "11450    11450  4.144822      21714          False       False        False\n",
       "13800    13800  4.143008       3747          False       False        False\n",
       "11737    11737  4.105857       2200          False       False        False\n",
       "17042    17042  4.030718       7072          False       False        False\n",
       "11541    11541  4.020617      21807          False       False        False\n",
       "14434    14434  4.010728       4400          False       False        False\n",
       "15138    15138  3.990831       5112          False       False        False\n",
       "13387    13387  3.970656       3329          False       False        False\n",
       "15009    15009  3.946043       4985          False       False        False\n",
       "1894      1894  3.926674      11941          False       False        False\n",
       "10290    10290  3.911465      20533          False       False        False\n",
       "2463      2463  3.884903      12529          False       False        False\n",
       "15083    15083  3.838665       5055          False       False        False\n",
       "19180    19180  3.832723       9231          False       False        False\n",
       "3512      3512  3.828612      13615          False       False        False\n",
       "7918      7918  3.818866      18112          False       False        False\n",
       "18017    18017  3.818447       8061          False       False        False\n",
       "2759      2759  3.805835      12835          False       False        False\n",
       "11317    11317  3.778868      21582          False       False        False\n",
       "1535      1535  3.773711      11579          False       False        False\n",
       "13507    13507  3.764307        345          False        True        False\n",
       "14210    14210  3.762934       4170          False       False        False\n",
       "3563      3563  3.749696      13669          False       False        False\n",
       "5641      5641  3.739637      15791          False       False        False\n",
       "14791    14791  3.730990       4764          False       False        False"
      ]
     },
     "execution_count": 266,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df1=pred_annotated1.df\n",
    "df1.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f9c2430b",
   "metadata": {},
   "source": [
    "### Writing back the results into Neo4j and exporting the results as csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "eaa2ee64",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 192,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidate_nodes = df[df['in_training'] == False].head(50)['tail_label'].to_list()\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($compound_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca)\n",
    "MERGE (n)-[:PREDICTED_UPREGULATED_QuatE_breast]->(c)\n",
    "\"\"\", {'compound_id':compound_id, 'candidates': candidate_nodes})\n",
    "\n",
    "# print(candidate_nodes)\n",
    "# print(compound_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "75150412",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 193,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidate_nodes1 = df1[df1['in_training'] == False].head(50)['tail_label'].to_list()\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($compound_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca)\n",
    "MERGE (n)-[:PREDICTED_UPREGULATED_ProjE_breast]->(c)\n",
    "\"\"\", {'compound_id':compound_id, 'candidates': candidate_nodes1})\n",
    "\n",
    "# print(candidate_nodes)\n",
    "# print(compound_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 294,
   "id": "eb9e82b1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>disease</th>\n",
       "      <th>gene</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>APOBEC3B</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>COG2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>EXOSC9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SQSTM1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>APP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SUV39H1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CMTM6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RRP1B</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>NMI</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>KLHL21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CCNA2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TSPAN7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RFC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RRP8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>UBE3C</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SAV1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CDK7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DNAJC9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GIMAP5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CASP10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>BRD1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>AKT1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>BCAP31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TXNIP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>STUB1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>C15orf39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ASCC3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PUF60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TBPL1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MFSD10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CDK1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CCNB2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>THYN1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>C2orf76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>VEGFA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>COX6A1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CCNB1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>UBQLN2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ADI1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PHGDH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RBKS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HAT1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>BCL7B</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PEG10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>COA7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TMX2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GRB10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CRTAP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DNAL4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          disease      gene\n",
       "0   breast cancer  APOBEC3B\n",
       "1   breast cancer      COG2\n",
       "2   breast cancer    EXOSC9\n",
       "3   breast cancer    SQSTM1\n",
       "4   breast cancer       APP\n",
       "5   breast cancer   SUV39H1\n",
       "6   breast cancer     CMTM6\n",
       "7   breast cancer     RRP1B\n",
       "8   breast cancer       NMI\n",
       "9   breast cancer    KLHL21\n",
       "10  breast cancer     CCNA2\n",
       "11  breast cancer    TSPAN7\n",
       "12  breast cancer      RFC4\n",
       "13  breast cancer      RRP8\n",
       "14  breast cancer     UBE3C\n",
       "15  breast cancer      SAV1\n",
       "16  breast cancer      CDK7\n",
       "17  breast cancer    DNAJC9\n",
       "18  breast cancer    GIMAP5\n",
       "19  breast cancer    CASP10\n",
       "20  breast cancer      BRD1\n",
       "21  breast cancer      AKT1\n",
       "22  breast cancer    BCAP31\n",
       "23  breast cancer     TXNIP\n",
       "24  breast cancer     STUB1\n",
       "25  breast cancer  C15orf39\n",
       "26  breast cancer     ASCC3\n",
       "27  breast cancer     PUF60\n",
       "28  breast cancer     TBPL1\n",
       "29  breast cancer    MFSD10\n",
       "30  breast cancer      CDK1\n",
       "31  breast cancer     CCNB2\n",
       "32  breast cancer     THYN1\n",
       "33  breast cancer      SMC4\n",
       "34  breast cancer   C2orf76\n",
       "35  breast cancer     VEGFA\n",
       "36  breast cancer    COX6A1\n",
       "37  breast cancer     CCNB1\n",
       "38  breast cancer    UBQLN2\n",
       "39  breast cancer      ADI1\n",
       "40  breast cancer     PHGDH\n",
       "41  breast cancer      RBKS\n",
       "42  breast cancer      HAT1\n",
       "43  breast cancer     BCL7B\n",
       "44  breast cancer     PEG10\n",
       "45  breast cancer      COA7\n",
       "46  breast cancer      TMX2\n",
       "47  breast cancer     GRB10\n",
       "48  breast cancer     CRTAP\n",
       "49  breast cancer     DNAL4"
      ]
     },
     "execution_count": 294,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease)-[:PREDICTED_UPREGULATED_QuatE_breast]->(d:Gene)\n",
    "RETURN c.name as disease, d.name as gene\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 295,
   "id": "ac407608",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Data has been exported to PREDICTED_UPREGULATED_QuatE_breast.csv.\n"
     ]
    }
   ],
   "source": [
    "gene_quat=run_query(\"\"\"\n",
    "MATCH (c:Disease)-[:PREDICTED_UPREGULATED_QuatE_breast]->(d:Gene)\n",
    "RETURN c.name as disease, d.name as gene\n",
    "\"\"\")\n",
    "\n",
    "# Convert the list of dictionaries to a pandas DataFrame\n",
    "df = pd.DataFrame(gene_quat)\n",
    "\n",
    "# Specify the file name for the CSV export\n",
    "csv_file = \"PREDICTED_UPREGULATED_QuatE_breast.csv\"\n",
    "\n",
    "# Export the DataFrame to CSV\n",
    "df.to_csv(csv_file, index=False)\n",
    "\n",
    "print(f\"Data has been exported to {csv_file}.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 290,
   "id": "07a2aa59",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, SMC4]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  [n in nodes(p) | n.name]\n",
       "0    [breast cancer, SMC4]"
      ]
     },
     "execution_count": 290,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene{name:\"SMC4\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 291,
   "id": "6f517b9a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, APOBEC3B]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    [n in nodes(p) | n.name]\n",
       "0  [breast cancer, APOBEC3B]"
      ]
     },
     "execution_count": 291,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene{name:\"APOBEC3B\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 292,
   "id": "9218bded",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, SQSTM1]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  [n in nodes(p) | n.name]\n",
       "0  [breast cancer, SQSTM1]"
      ]
     },
     "execution_count": 292,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene{name:\"SQSTM1\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 269,
   "id": "05e785b3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>disease</th>\n",
       "      <th>gene</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SPP1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>WIF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TUBA1A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>OXA1L</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>LBR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CDK4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SSBP2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>JUN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TMEM109</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>AGR2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DLD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ALDOC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>VIM</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>IGHMBP2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>IFRD2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CNDP2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TERF2IP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>C2CD2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DHDDS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CES1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DDX42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MYC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RPIA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>NME1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HIST1H4I</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GDF15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HSPA8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PSMB8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MCOLN1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PCBD1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MAL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HIST2H2BE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TWF2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ST7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ATP6V1D</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TIMM9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CRKL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CCNA2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RPS4Y1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SESN1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ADGRE5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HMG20B</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PDHX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PAK1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RUVBL1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>STUB1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SPR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MRPL12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          disease       gene\n",
       "0   breast cancer       SPP1\n",
       "1   breast cancer       WIF1\n",
       "2   breast cancer     TUBA1A\n",
       "3   breast cancer      OXA1L\n",
       "4   breast cancer        LBR\n",
       "5   breast cancer       CDK4\n",
       "6   breast cancer      SSBP2\n",
       "7   breast cancer        JUN\n",
       "8   breast cancer    TMEM109\n",
       "9   breast cancer       AGR2\n",
       "10  breast cancer        DLD\n",
       "11  breast cancer      ALDOC\n",
       "12  breast cancer        VIM\n",
       "13  breast cancer    IGHMBP2\n",
       "14  breast cancer      IFRD2\n",
       "15  breast cancer      CNDP2\n",
       "16  breast cancer    TERF2IP\n",
       "17  breast cancer      C2CD2\n",
       "18  breast cancer      DHDDS\n",
       "19  breast cancer       CES1\n",
       "20  breast cancer      DDX42\n",
       "21  breast cancer        MYC\n",
       "22  breast cancer       SMC4\n",
       "23  breast cancer       RPIA\n",
       "24  breast cancer       NME1\n",
       "25  breast cancer   HIST1H4I\n",
       "26  breast cancer      GDF15\n",
       "27  breast cancer      HSPA8\n",
       "28  breast cancer      PSMB8\n",
       "29  breast cancer     MCOLN1\n",
       "30  breast cancer      PCBD1\n",
       "31  breast cancer        MAL\n",
       "32  breast cancer  HIST2H2BE\n",
       "33  breast cancer       TWF2\n",
       "34  breast cancer        ST7\n",
       "35  breast cancer    ATP6V1D\n",
       "36  breast cancer      TIMM9\n",
       "37  breast cancer       CRKL\n",
       "38  breast cancer      CCNA2\n",
       "39  breast cancer     RPS4Y1\n",
       "40  breast cancer      SESN1\n",
       "41  breast cancer     ADGRE5\n",
       "42  breast cancer     HMG20B\n",
       "43  breast cancer       PDHX\n",
       "44  breast cancer       PAK1\n",
       "45  breast cancer     RUVBL1\n",
       "46  breast cancer      STUB1\n",
       "47  breast cancer        SPR\n",
       "48  breast cancer     MRPL12"
      ]
     },
     "execution_count": 269,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease)-[:PREDICTED_UPREGULATED_ProjE_breast]->(d:Gene)\n",
    "RETURN c.name as disease, d.name as gene\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 297,
   "id": "baccab17",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Data has been exported to PREDICTED_UPREGULATED_ProjE_breast.csv.\n"
     ]
    }
   ],
   "source": [
    "gene_proje=run_query(\"\"\"\n",
    "MATCH (c:Disease)-[:PREDICTED_UPREGULATED_ProjE_breast]->(d:Gene)\n",
    "RETURN c.name as disease, d.name as gene\n",
    "\"\"\")\n",
    "# Convert the list of dictionaries to a pandas DataFrame\n",
    "df = pd.DataFrame(gene_proje)\n",
    "\n",
    "# Specify the file name for the CSV export\n",
    "csv_file = \"PREDICTED_UPREGULATED_ProjE_breast.csv\"\n",
    "\n",
    "# Export the DataFrame to CSV\n",
    "df.to_csv(csv_file, index=False)\n",
    "\n",
    "print(f\"Data has been exported to {csv_file}.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 287,
   "id": "d25b9c84",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, SPP1]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  [n in nodes(p) | n.name]\n",
       "0    [breast cancer, SPP1]"
      ]
     },
     "execution_count": 287,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene{name:\"SPP1\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 288,
   "id": "272a0746",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, SMC4]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  [n in nodes(p) | n.name]\n",
       "0    [breast cancer, SMC4]"
      ]
     },
     "execution_count": 288,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene{name:\"SMC4\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 289,
   "id": "698371cc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, TGFBR2, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[breast cancer, F3, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[breast cancer, GPX4, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[breast cancer, NFKBIA, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[breast cancer, MAPK13, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[breast cancer, SPRY1, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[breast cancer, TP53, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[breast cancer, CDKN1A, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[breast cancer, COMT, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[breast cancer, EGFR, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[breast cancer, MTOR, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[breast cancer, MYBL2, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[breast cancer, BIRC5, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[breast cancer, TYMS, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[breast cancer, KRT19, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[breast cancer, EGFR, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[breast cancer, ANXA1, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[breast cancer, SNCA, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[breast cancer, RPS13, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[breast cancer, ABCB1, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[breast cancer, FBL, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[breast cancer, RAF1, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[breast cancer, MYC, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[breast cancer, DHTKD1, TUBA1A]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[breast cancer, BIRC5, TUBA1A]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           [n in nodes(p) | n.name]\n",
       "0   [breast cancer, TGFBR2, TUBA1A]\n",
       "1       [breast cancer, F3, TUBA1A]\n",
       "2     [breast cancer, GPX4, TUBA1A]\n",
       "3   [breast cancer, NFKBIA, TUBA1A]\n",
       "4   [breast cancer, MAPK13, TUBA1A]\n",
       "5    [breast cancer, SPRY1, TUBA1A]\n",
       "6     [breast cancer, TP53, TUBA1A]\n",
       "7   [breast cancer, CDKN1A, TUBA1A]\n",
       "8     [breast cancer, COMT, TUBA1A]\n",
       "9     [breast cancer, EGFR, TUBA1A]\n",
       "10    [breast cancer, MTOR, TUBA1A]\n",
       "11   [breast cancer, MYBL2, TUBA1A]\n",
       "12   [breast cancer, BIRC5, TUBA1A]\n",
       "13    [breast cancer, TYMS, TUBA1A]\n",
       "14   [breast cancer, KRT19, TUBA1A]\n",
       "15    [breast cancer, EGFR, TUBA1A]\n",
       "16   [breast cancer, ANXA1, TUBA1A]\n",
       "17    [breast cancer, SNCA, TUBA1A]\n",
       "18   [breast cancer, RPS13, TUBA1A]\n",
       "19   [breast cancer, ABCB1, TUBA1A]\n",
       "20     [breast cancer, FBL, TUBA1A]\n",
       "21    [breast cancer, RAF1, TUBA1A]\n",
       "22     [breast cancer, MYC, TUBA1A]\n",
       "23  [breast cancer, DHTKD1, TUBA1A]\n",
       "24   [breast cancer, BIRC5, TUBA1A]"
      ]
     },
     "execution_count": 289,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene{name:\"TUBA1A\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1ac5bc3",
   "metadata": {},
   "source": [
    "# Usecase2: Analysis for Drug connected to gene SMC4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 271,
   "id": "c3c5e413",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'345'"
      ]
     },
     "execution_count": 271,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#from pykeen import predict\n",
    "from pykeen.predict import predict_target\n",
    "compound_id_g = run_query(\"\"\"\n",
    "MATCH (s:Gene)\n",
    "WHERE s.name = \"SMC4\"\n",
    "RETURN toString(id(s)) as id\n",
    "\"\"\")['id'][0]\n",
    "\n",
    "compound_id_g\n",
    "\n",
    "#df\n",
    "#df['in_training']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 272,
   "id": "90028d8b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TargetPredictions(df=       head_id     score head_label\n",
      "11547    11547  4.428504      21814\n",
      "4377      4377  4.383505      14486\n",
      "7382      7382  4.317099      17565\n",
      "14396    14396  4.285762       4360\n",
      "10375    10375  4.283663      20624\n",
      "...        ...       ...        ...\n",
      "9789      9789 -1.641454      20029\n",
      "18837    18837 -1.670421       8889\n",
      "18903    18903 -1.720475       8954\n",
      "17148    17148 -1.793026       7182\n",
      "11449    11449 -2.005073      21711\n",
      "\n",
      "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='head', other_columns_fixed_ids=(4, 13507))\n"
     ]
    }
   ],
   "source": [
    "df_g = predict_target(model=result.model,\n",
    "                    relation='downregulates',\n",
    "                    tail=compound_id_g,\n",
    "                    triples_factory=result.training,)\n",
    "print(df_g)\n",
    "#what is df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "id": "b1d0f956",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "TargetPredictions(df=       head_id     score head_label\n",
      "13507    13507  6.184639        345\n",
      "10290    10290  5.133840      20533\n",
      "11332    11332  5.056638      21599\n",
      "15138    15138  4.973536       5112\n",
      "5174      5174  4.964867      15314\n",
      "...        ...       ...        ...\n",
      "16364    16364 -1.194883       6372\n",
      "19624    19624 -1.199694       9689\n",
      "10075    10075 -1.213256       2032\n",
      "19621    19621 -1.251976       9685\n",
      "2133      2133 -1.553366      12177\n",
      "\n",
      "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='head', other_columns_fixed_ids=(4, 13507))\n"
     ]
    }
   ],
   "source": [
    "df_g_1 = predict_target(model=result1.model,\n",
    "                    relation='downregulates',\n",
    "                    tail=compound_id_g,\n",
    "                    triples_factory=result1.training,)\n",
    "print(df_g_1)\n",
    "#what is df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "id": "1f176853",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred_filtered_g = df_g.filter_triples(training)\n",
    "pred_filtered_g_1 = df_g_1.filter_triples(training)\n",
    "pred_annotated_g = pred_filtered_g.add_membership_columns(validation=validation, testing=testing, training=training)\n",
    "pred_annotated_g_1 = pred_filtered_g_1.add_membership_columns(validation=validation, testing=testing, training=training)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "id": "e95bb5e0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id     score head_label\n",
       "4377      4377  4.383505      14486\n",
       "14396    14396  4.285762       4360\n",
       "5377      5377  4.238102      15522\n",
       "8903      8903  4.218297      19130\n",
       "11210    11210  4.130627      21472\n",
       "...        ...       ...        ...\n",
       "9789      9789 -1.641454      20029\n",
       "18837    18837 -1.670421       8889\n",
       "18903    18903 -1.720475       8954\n",
       "17148    17148 -1.793026       7182\n",
       "11449    11449 -2.005073      21711\n",
       "\n",
       "[19901 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 275,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered_g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "id": "9282f587",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id     score head_label\n",
       "13507    13507  6.184639        345\n",
       "10290    10290  5.133840      20533\n",
       "11332    11332  5.056638      21599\n",
       "15138    15138  4.973536       5112\n",
       "5174      5174  4.964867      15314\n",
       "...        ...       ...        ...\n",
       "16364    16364 -1.194883       6372\n",
       "19624    19624 -1.199694       9689\n",
       "10075    10075 -1.213256       2032\n",
       "19621    19621 -1.251976       9685\n",
       "2133      2133 -1.553366      12177\n",
       "\n",
       "[19901 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 276,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered_g_1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "id": "693c979a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id     score head_label  in_validation  in_testing  in_training\n",
       "4377      4377  4.383505      14486          False       False        False\n",
       "14396    14396  4.285762       4360          False       False        False\n",
       "5377      5377  4.238102      15522          False       False        False\n",
       "8903      8903  4.218297      19130          False       False        False\n",
       "11210    11210  4.130627      21472          False       False        False\n",
       "...        ...       ...        ...            ...         ...          ...\n",
       "9789      9789 -1.641454      20029          False       False        False\n",
       "18837    18837 -1.670421       8889          False       False        False\n",
       "18903    18903 -1.720475       8954          False       False        False\n",
       "17148    17148 -1.793026       7182          False       False        False\n",
       "11449    11449 -2.005073      21711          False       False        False\n",
       "\n",
       "[19901 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 277,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated_g"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "id": "798dd419",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id     score head_label  in_validation  in_testing  in_training\n",
       "13507    13507  6.184639        345          False       False        False\n",
       "10290    10290  5.133840      20533          False       False        False\n",
       "11332    11332  5.056638      21599          False       False        False\n",
       "15138    15138  4.973536       5112          False       False        False\n",
       "5174      5174  4.964867      15314          False       False        False\n",
       "...        ...       ...        ...            ...         ...          ...\n",
       "16364    16364 -1.194883       6372          False       False        False\n",
       "19624    19624 -1.199694       9689          False       False        False\n",
       "10075    10075 -1.213256       2032          False       False        False\n",
       "19621    19621 -1.251976       9685          False       False        False\n",
       "2133      2133 -1.553366      12177          False       False        False\n",
       "\n",
       "[19901 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=393204), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 278,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated_g_1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "id": "1bb65c84",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>head_id</th>\n",
       "      <th>score</th>\n",
       "      <th>head_label</th>\n",
       "      <th>in_validation</th>\n",
       "      <th>in_testing</th>\n",
       "      <th>in_training</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>4377</th>\n",
       "      <td>4377</td>\n",
       "      <td>4.383505</td>\n",
       "      <td>14486</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14396</th>\n",
       "      <td>14396</td>\n",
       "      <td>4.285762</td>\n",
       "      <td>4360</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5377</th>\n",
       "      <td>5377</td>\n",
       "      <td>4.238102</td>\n",
       "      <td>15522</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8903</th>\n",
       "      <td>8903</td>\n",
       "      <td>4.218297</td>\n",
       "      <td>19130</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11210</th>\n",
       "      <td>11210</td>\n",
       "      <td>4.130627</td>\n",
       "      <td>21472</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11483</th>\n",
       "      <td>11483</td>\n",
       "      <td>4.119243</td>\n",
       "      <td>21750</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18135</th>\n",
       "      <td>18135</td>\n",
       "      <td>4.115297</td>\n",
       "      <td>818</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2705</th>\n",
       "      <td>2705</td>\n",
       "      <td>4.113011</td>\n",
       "      <td>1278</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19247</th>\n",
       "      <td>19247</td>\n",
       "      <td>4.089200</td>\n",
       "      <td>9297</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10206</th>\n",
       "      <td>10206</td>\n",
       "      <td>4.073489</td>\n",
       "      <td>20454</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7709</th>\n",
       "      <td>7709</td>\n",
       "      <td>4.027683</td>\n",
       "      <td>17897</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14469</th>\n",
       "      <td>14469</td>\n",
       "      <td>3.864246</td>\n",
       "      <td>4437</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19001</th>\n",
       "      <td>19001</td>\n",
       "      <td>3.821442</td>\n",
       "      <td>9052</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3436</th>\n",
       "      <td>3436</td>\n",
       "      <td>3.814211</td>\n",
       "      <td>13539</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13491</th>\n",
       "      <td>13491</td>\n",
       "      <td>3.794995</td>\n",
       "      <td>3431</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8582</th>\n",
       "      <td>8582</td>\n",
       "      <td>3.761703</td>\n",
       "      <td>18795</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1351</th>\n",
       "      <td>1351</td>\n",
       "      <td>3.739664</td>\n",
       "      <td>11388</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11827</th>\n",
       "      <td>11827</td>\n",
       "      <td>3.690243</td>\n",
       "      <td>22096</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19008</th>\n",
       "      <td>19008</td>\n",
       "      <td>3.676739</td>\n",
       "      <td>9059</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4817</th>\n",
       "      <td>4817</td>\n",
       "      <td>3.669536</td>\n",
       "      <td>14949</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16581</th>\n",
       "      <td>16581</td>\n",
       "      <td>3.668883</td>\n",
       "      <td>6592</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>785</th>\n",
       "      <td>785</td>\n",
       "      <td>3.665746</td>\n",
       "      <td>10808</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14732</th>\n",
       "      <td>14732</td>\n",
       "      <td>3.663524</td>\n",
       "      <td>4704</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>145</th>\n",
       "      <td>145</td>\n",
       "      <td>3.651080</td>\n",
       "      <td>10144</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9040</th>\n",
       "      <td>9040</td>\n",
       "      <td>3.643026</td>\n",
       "      <td>19270</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>290</th>\n",
       "      <td>290</td>\n",
       "      <td>3.600539</td>\n",
       "      <td>10295</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9532</th>\n",
       "      <td>9532</td>\n",
       "      <td>3.594455</td>\n",
       "      <td>19772</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16296</th>\n",
       "      <td>16296</td>\n",
       "      <td>3.573354</td>\n",
       "      <td>6304</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3618</th>\n",
       "      <td>3618</td>\n",
       "      <td>3.568666</td>\n",
       "      <td>13726</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6395</th>\n",
       "      <td>6395</td>\n",
       "      <td>3.540277</td>\n",
       "      <td>16565</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       head_id     score head_label  in_validation  in_testing  in_training\n",
       "4377      4377  4.383505      14486          False       False        False\n",
       "14396    14396  4.285762       4360          False       False        False\n",
       "5377      5377  4.238102      15522          False       False        False\n",
       "8903      8903  4.218297      19130          False       False        False\n",
       "11210    11210  4.130627      21472          False       False        False\n",
       "11483    11483  4.119243      21750          False       False        False\n",
       "18135    18135  4.115297        818          False        True        False\n",
       "2705      2705  4.113011       1278          False       False        False\n",
       "19247    19247  4.089200       9297          False       False        False\n",
       "10206    10206  4.073489      20454          False       False        False\n",
       "7709      7709  4.027683      17897          False       False        False\n",
       "14469    14469  3.864246       4437          False       False        False\n",
       "19001    19001  3.821442       9052          False       False        False\n",
       "3436      3436  3.814211      13539          False       False        False\n",
       "13491    13491  3.794995       3431          False        True        False\n",
       "8582      8582  3.761703      18795          False       False        False\n",
       "1351      1351  3.739664      11388          False       False        False\n",
       "11827    11827  3.690243      22096          False       False        False\n",
       "19008    19008  3.676739       9059          False       False        False\n",
       "4817      4817  3.669536      14949          False       False        False\n",
       "16581    16581  3.668883       6592          False       False        False\n",
       "785        785  3.665746      10808          False       False        False\n",
       "14732    14732  3.663524       4704          False       False        False\n",
       "145        145  3.651080      10144          False       False        False\n",
       "9040      9040  3.643026      19270          False       False        False\n",
       "290        290  3.600539      10295          False       False        False\n",
       "9532      9532  3.594455      19772          False       False        False\n",
       "16296    16296  3.573354       6304          False       False        False\n",
       "3618      3618  3.568666      13726          False       False        False\n",
       "6395      6395  3.540277      16565          False       False        False"
      ]
     },
     "execution_count": 279,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_g=pred_annotated_g.df\n",
    "df_g.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "id": "560ac0cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>head_id</th>\n",
       "      <th>score</th>\n",
       "      <th>head_label</th>\n",
       "      <th>in_validation</th>\n",
       "      <th>in_testing</th>\n",
       "      <th>in_training</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>13507</th>\n",
       "      <td>13507</td>\n",
       "      <td>6.184639</td>\n",
       "      <td>345</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10290</th>\n",
       "      <td>10290</td>\n",
       "      <td>5.133840</td>\n",
       "      <td>20533</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11332</th>\n",
       "      <td>11332</td>\n",
       "      <td>5.056638</td>\n",
       "      <td>21599</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15138</th>\n",
       "      <td>15138</td>\n",
       "      <td>4.973536</td>\n",
       "      <td>5112</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5174</th>\n",
       "      <td>5174</td>\n",
       "      <td>4.964867</td>\n",
       "      <td>15314</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13785</th>\n",
       "      <td>13785</td>\n",
       "      <td>4.919665</td>\n",
       "      <td>3731</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15009</th>\n",
       "      <td>15009</td>\n",
       "      <td>4.902075</td>\n",
       "      <td>4985</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19180</th>\n",
       "      <td>19180</td>\n",
       "      <td>4.870707</td>\n",
       "      <td>9231</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3266</th>\n",
       "      <td>3266</td>\n",
       "      <td>4.836885</td>\n",
       "      <td>1336</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19586</th>\n",
       "      <td>19586</td>\n",
       "      <td>4.833000</td>\n",
       "      <td>9646</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17068</th>\n",
       "      <td>17068</td>\n",
       "      <td>4.829069</td>\n",
       "      <td>7097</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7078</th>\n",
       "      <td>7078</td>\n",
       "      <td>4.803919</td>\n",
       "      <td>17256</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18017</th>\n",
       "      <td>18017</td>\n",
       "      <td>4.803583</td>\n",
       "      <td>8061</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9436</th>\n",
       "      <td>9436</td>\n",
       "      <td>4.800907</td>\n",
       "      <td>19676</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13387</th>\n",
       "      <td>13387</td>\n",
       "      <td>4.789632</td>\n",
       "      <td>3329</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8441</th>\n",
       "      <td>8441</td>\n",
       "      <td>4.763255</td>\n",
       "      <td>18651</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2433</th>\n",
       "      <td>2433</td>\n",
       "      <td>4.759102</td>\n",
       "      <td>12495</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16202</th>\n",
       "      <td>16202</td>\n",
       "      <td>4.756735</td>\n",
       "      <td>6212</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11317</th>\n",
       "      <td>11317</td>\n",
       "      <td>4.754403</td>\n",
       "      <td>21582</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9142</th>\n",
       "      <td>9142</td>\n",
       "      <td>4.745804</td>\n",
       "      <td>19372</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9401</th>\n",
       "      <td>9401</td>\n",
       "      <td>4.744359</td>\n",
       "      <td>19641</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9147</th>\n",
       "      <td>9147</td>\n",
       "      <td>4.735672</td>\n",
       "      <td>19377</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10395</th>\n",
       "      <td>10395</td>\n",
       "      <td>4.684960</td>\n",
       "      <td>20645</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9817</th>\n",
       "      <td>9817</td>\n",
       "      <td>4.683969</td>\n",
       "      <td>20057</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17331</th>\n",
       "      <td>17331</td>\n",
       "      <td>4.677492</td>\n",
       "      <td>7362</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11488</th>\n",
       "      <td>11488</td>\n",
       "      <td>4.667829</td>\n",
       "      <td>21755</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12497</th>\n",
       "      <td>12497</td>\n",
       "      <td>4.665241</td>\n",
       "      <td>2400</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7835</th>\n",
       "      <td>7835</td>\n",
       "      <td>4.650074</td>\n",
       "      <td>18028</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14565</th>\n",
       "      <td>14565</td>\n",
       "      <td>4.642791</td>\n",
       "      <td>4536</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19467</th>\n",
       "      <td>19467</td>\n",
       "      <td>4.631272</td>\n",
       "      <td>953</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       head_id     score head_label  in_validation  in_testing  in_training\n",
       "13507    13507  6.184639        345          False       False        False\n",
       "10290    10290  5.133840      20533          False       False        False\n",
       "11332    11332  5.056638      21599          False       False        False\n",
       "15138    15138  4.973536       5112          False       False        False\n",
       "5174      5174  4.964867      15314          False       False        False\n",
       "13785    13785  4.919665       3731          False       False        False\n",
       "15009    15009  4.902075       4985          False       False        False\n",
       "19180    19180  4.870707       9231          False       False        False\n",
       "3266      3266  4.836885       1336          False       False        False\n",
       "19586    19586  4.833000       9646          False       False        False\n",
       "17068    17068  4.829069       7097          False       False        False\n",
       "7078      7078  4.803919      17256          False       False        False\n",
       "18017    18017  4.803583       8061          False       False        False\n",
       "9436      9436  4.800907      19676          False       False        False\n",
       "13387    13387  4.789632       3329          False       False        False\n",
       "8441      8441  4.763255      18651          False       False        False\n",
       "2433      2433  4.759102      12495          False       False        False\n",
       "16202    16202  4.756735       6212          False       False        False\n",
       "11317    11317  4.754403      21582          False       False        False\n",
       "9142      9142  4.745804      19372          False       False        False\n",
       "9401      9401  4.744359      19641          False       False        False\n",
       "9147      9147  4.735672      19377          False       False        False\n",
       "10395    10395  4.684960      20645          False       False        False\n",
       "9817      9817  4.683969      20057          False       False        False\n",
       "17331    17331  4.677492       7362          False       False        False\n",
       "11488    11488  4.667829      21755          False       False        False\n",
       "12497    12497  4.665241       2400          False       False        False\n",
       "7835      7835  4.650074      18028          False       False        False\n",
       "14565    14565  4.642791       4536          False       False        False\n",
       "19467    19467  4.631272        953          False       False        False"
      ]
     },
     "execution_count": 280,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_g_1=pred_annotated_g_1.df\n",
    "df_g_1.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7442f4e6",
   "metadata": {},
   "source": [
    "### Wrting back the results into Neo4j and exporting the results as csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "id": "72015999",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 211,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidate_nodes_g = df_g[df_g['in_training'] == False].head(50)['head_label'].to_list()\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($compound_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca) AND \"Compound\" IN LABELS(c)\n",
    "MERGE (c)-[:PREDICTED_DOWNREGULATED_QuatE_breast]->(n)\n",
    "\"\"\", {'compound_id':compound_id_g, 'candidates': candidate_nodes_g})\n",
    "\n",
    "# print(candidate_nodes)\n",
    "# print(compound_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 212,
   "id": "d894e1b7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 212,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidate_nodes_g_1 = df_g_1[df_g_1['in_training'] == False].head(50)['head_label'].to_list()\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($compound_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca) AND \"Compound\" IN LABELS(c)\n",
    "MERGE (c)-[:PREDICTED_DOWNREGULATED_ProjE_breast]->(n)\n",
    "\"\"\", {'compound_id':compound_id_g, 'candidates': candidate_nodes_g_1})\n",
    "\n",
    "# print(candidate_nodes)\n",
    "# print(compound_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 281,
   "id": "997d8bbc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "      <th>type(r)</th>\n",
       "      <th>m.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Ponatinib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Simvastatin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bortezomib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dactinomycin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Temsirolimus</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Digitoxin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Afatinib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Sirolimus</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Tretinoin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Sorafenib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Vemurafenib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Homoharringtonine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Betamethasone</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Vincristine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Gemcitabine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Alitretinoin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Treprostinil</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Isotretinoin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Danazol</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Terbinafine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Pazopanib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Ouabain</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Lovastatin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Mebendazole</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Everolimus</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Testosterone</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Vinblastine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Estradiol</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Digoxin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Thioridazine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Varenicline</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Tamoxifen</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Ruxolitinib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Daunorubicin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Vinorelbine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Trametinib</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Ciclopirox</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Thiothixene</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Dexamethasone</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Azacitidine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Pitavastatin</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Paroxetine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Podofilox</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Busulfan</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Disulfiram</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Bupropion</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>Thiotepa</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>Paclitaxel</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>Fluorometholone</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>Cladribine</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_QuatE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               n.name                               type(r) m.name\n",
       "0           Ponatinib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "1         Simvastatin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "2          Bortezomib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "3        Dactinomycin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "4        Temsirolimus  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "5           Digitoxin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "6            Afatinib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "7           Sirolimus  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "8           Tretinoin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "9           Sorafenib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "10        Vemurafenib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "11  Homoharringtonine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "12      Betamethasone  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "13        Vincristine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "14        Gemcitabine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "15       Alitretinoin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "16       Treprostinil  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "17       Isotretinoin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "18            Danazol  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "19        Terbinafine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "20          Pazopanib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "21            Ouabain  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "22         Lovastatin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "23        Mebendazole  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "24         Everolimus  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "25       Testosterone  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "26        Vinblastine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "27          Estradiol  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "28            Digoxin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "29       Thioridazine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "30        Varenicline  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "31          Tamoxifen  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "32        Ruxolitinib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "33       Daunorubicin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "34        Vinorelbine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "35         Trametinib  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "36         Ciclopirox  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "37        Thiothixene  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "38      Dexamethasone  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "39        Azacitidine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "40       Pitavastatin  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "41         Paroxetine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "42          Podofilox  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "43           Busulfan  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "44         Disulfiram  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "45          Bupropion  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "46           Thiotepa  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "47         Paclitaxel  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "48    Fluorometholone  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4\n",
       "49         Cladribine  PREDICTED_DOWNREGULATED_QuatE_breast   SMC4"
      ]
     },
     "execution_count": 281,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "match (n:Compound)-[r:PREDICTED_DOWNREGULATED_QuatE_breast]->(m:Gene) return n.name,type(r),m.name\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "id": "73ab8420",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Data has been exported to PREDICTED_DOWNREGULATED_QuatE_breast.csv.\n"
     ]
    }
   ],
   "source": [
    "drug_quate=run_query(\"\"\"\n",
    "match (n:Compound)-[r:PREDICTED_DOWNREGULATED_QuatE_breast]->(m:Gene) return n.name,type(r),m.name\n",
    "\"\"\")\n",
    "# Convert the list of dictionaries to a pandas DataFrame\n",
    "df = pd.DataFrame(drug_quate)\n",
    "\n",
    "# Specify the file name for the CSV export\n",
    "csv_file = \"PREDICTED_DOWNREGULATED_QuatE_breast.csv\"\n",
    "\n",
    "# Export the DataFrame to CSV\n",
    "df.to_csv(csv_file, index=False)\n",
    "\n",
    "print(f\"Data has been exported to {csv_file}.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 282,
   "id": "970f9dfa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "      <th>type(r)</th>\n",
       "      <th>m.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Perhexiline</td>\n",
       "      <td>PREDICTED_DOWNREGULATED_ProjE_breast</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        n.name                               type(r) m.name\n",
       "0  Perhexiline  PREDICTED_DOWNREGULATED_ProjE_breast   SMC4"
      ]
     },
     "execution_count": 282,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "match (n:Compound)-[r:PREDICTED_DOWNREGULATED_ProjE_breast]->(m:Gene) return n.name,type(r),m.name\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 299,
   "id": "868afff9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Data has been exported to PREDICTED_DOWNREGULATED_ProjE_breast.csv.\n"
     ]
    }
   ],
   "source": [
    "drug_proje=run_query(\"\"\"\n",
    "match (n:Compound)-[r:PREDICTED_DOWNREGULATED_ProjE_breast]->(m:Gene) return n.name,type(r),m.name\n",
    "\"\"\")\n",
    "# Convert the list of dictionaries to a pandas DataFrame\n",
    "df = pd.DataFrame(drug_proje)\n",
    "\n",
    "# Specify the file name for the CSV export\n",
    "csv_file = \"PREDICTED_DOWNREGULATED_ProjE_breast.csv\"\n",
    "\n",
    "# Export the DataFrame to CSV\n",
    "df.to_csv(csv_file, index=False)\n",
    "\n",
    "print(f\"Data has been exported to {csv_file}.\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
