{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "aa7ae2f1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define Neo4j connections\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import numpy"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "fda562c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "host = 'bolt://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = '12345678'\n",
    "database = 'dbms2'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "44d52877",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(host,auth=(user, password), database=database)\n",
    "                                         \n",
    "\n",
    "def run_query(query, params={}):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params)\n",
    "        return pd.DataFrame([r.values() for r in result], columns=result.keys())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "61fd6ebe",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = run_query(\"\"\"\n",
    "MATCH (s)-[r]->(t)\n",
    "RETURN toString(id(s)) as source, toString(id(t)) AS target, type(r) as type\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9a079acb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>target</th>\n",
       "      <th>type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>12590</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0</td>\n",
       "      <td>8752</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>7915</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>21711</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0</td>\n",
       "      <td>6447</td>\n",
       "      <td>interacts</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  source target       type\n",
       "0      0  12590  interacts\n",
       "1      0   8752  interacts\n",
       "2      0   7915  interacts\n",
       "3      0  21711  interacts\n",
       "4      0   6447  interacts"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "28d6e80f",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pykeen.triples import TriplesFactory\n",
    "\n",
    "\n",
    "tf = TriplesFactory.from_labeled_triples(\n",
    "  data[[\"source\", \"type\", \"target\"]].values,\n",
    "  create_inverse_triples=False,\n",
    "  entity_to_id=None,\n",
    "  relation_to_id=None,\n",
    "  compact_id=False,\n",
    "  filter_out_candidate_inverse_relations=True,\n",
    "  metadata=None,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "7af86855",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "using automatically assigned random_state=4156377184\n"
     ]
    }
   ],
   "source": [
    "training, testing, validation = tf.split([.8, .1, .1])\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "beb3ee14",
   "metadata": {},
   "source": [
    "# Running ComplEx,TransE and ConvE models"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "fcc4bd06",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:pykeen.utils:No cuda devices were available. The model runs on CPU\n",
      "INFO:pykeen.pipeline.api:Using device: None\n",
      "INFO:pykeen.stoppers.early_stopping:Inferred checkpoint path for best model weights: C:\\Users\\shubh\\.data\\pykeen\\checkpoints\\best-model-weights-a46415ec-4c39-4630-8f2d-6a8645046df1.pt\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "3f46e1f5f53544e88a44125ff861014b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training epochs on cpu:   0%|          | 0/3 [00:00<?, ?epoch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1759 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1759 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1759 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Currently automatic memory optimization only supports GPUs, but you're using a CPU. Therefore, the batch_size will be set to the default value.\n",
      "INFO:pykeen.evaluation.evaluator:No evaluation batch_size provided. Setting batch_size to '32'.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "38ccf1d8b63e4bb18a685bac73c809cc",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating on cpu:   0%|          | 0.00/56.3k [00:00<?, ?triple/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Evaluation took 847.32s seconds\n"
     ]
    }
   ],
   "source": [
    "from pykeen.pipeline import pipeline\n",
    "\n",
    "result = pipeline(\n",
    "    training=training,\n",
    "    testing=testing,\n",
    "    validation=validation,\n",
    "    model='ComplEx',\n",
    "    stopper='early',\n",
    "    epochs=3,\n",
    "    dimensions=512,\n",
    "    random_seed=420\n",
    "\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b12ccdd0",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:pykeen.utils:No cuda devices were available. The model runs on CPU\n",
      "INFO:pykeen.pipeline.api:Using device: None\n",
      "INFO:pykeen.stoppers.early_stopping:Inferred checkpoint path for best model weights: C:\\Users\\shubh\\.data\\pykeen\\checkpoints\\best-model-weights-b07b9ea3-2fad-4879-87f1-de8a1c4d830a.pt\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "e850fe004e46401094ec3776fb97d31b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training epochs on cpu:   0%|          | 0/3 [00:00<?, ?epoch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1759 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1759 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1759 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Currently automatic memory optimization only supports GPUs, but you're using a CPU. Therefore, the batch_size will be set to the default value.\n",
      "INFO:pykeen.evaluation.evaluator:No evaluation batch_size provided. Setting batch_size to '32'.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "6016046aba8c435da768a17f06b618da",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating on cpu:   0%|          | 0.00/56.3k [00:00<?, ?triple/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Evaluation took 595.62s seconds\n"
     ]
    }
   ],
   "source": [
    "result2 = pipeline(\n",
    "    training=training,\n",
    "    testing=testing,\n",
    "    validation=validation,\n",
    "    model='TransE',\n",
    "    stopper='early',\n",
    "    epochs=3,\n",
    "    dimensions=512,\n",
    "    random_seed=420\n",
    "\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4847a651",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:pykeen.utils:No cuda devices were available. The model runs on CPU\n",
      "INFO:pykeen.pipeline.api:Using device: None\n",
      "WARNING:pykeen.models.unimodal.conv_e:\n",
      "The ConvE model should be trained with inverse triples.\n",
      "This can be done by defining the TriplesFactory class with the _create_inverse_triples_ parameter set to true.\n",
      "INFO:pykeen.nn.modules:Resolving None * None * None = 200.\n",
      "INFO:pykeen.nn.modules:Resolved to 1 * 20 * 10 = 200.\n",
      "INFO:pykeen.stoppers.early_stopping:Inferred checkpoint path for best model weights: C:\\Users\\shubh\\.data\\pykeen\\checkpoints\\best-model-weights-f6947946-1abf-4e66-9b43-e7984e2592ae.pt\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "1a0157edc1534ebab867807610cd0f0d",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training epochs on cpu:   0%|          | 0/3 [00:00<?, ?epoch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.training.training_loop:Dropping last (incomplete) batch each epoch (1/1758 (0.06%) batches).\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1758 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1758 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Training batches on cpu:   0%|          | 0/1758 [00:00<?, ?batch/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.evaluation.evaluator:Currently automatic memory optimization only supports GPUs, but you're using a CPU. Therefore, the batch_size will be set to the default value.\n",
      "INFO:pykeen.evaluation.evaluator:No evaluation batch_size provided. Setting batch_size to '32'.\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "2790ae9817924383adeb311db2581720",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating on cpu:   0%|          | 0.00/56.3k [00:00<?, ?triple/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "ename": "RuntimeError",
     "evalue": "[enforce fail at ..\\c10\\core\\impl\\alloc_cpu.cpp:72] data. DefaultCPUAllocator: not enough memory: you tried to allocate 26449182720 bytes.",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mRuntimeError\u001b[0m                              Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[10], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m result3 \u001b[38;5;241m=\u001b[39m \u001b[43mpipeline\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m      2\u001b[0m \u001b[43m    \u001b[49m\u001b[43mtraining\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtraining\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m      3\u001b[0m \u001b[43m    \u001b[49m\u001b[43mtesting\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtesting\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m      4\u001b[0m \u001b[43m    \u001b[49m\u001b[43mvalidation\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mvalidation\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m      5\u001b[0m \u001b[43m    \u001b[49m\u001b[43mmodel\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mConvE\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m      6\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstopper\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mearly\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m      7\u001b[0m \u001b[43m    \u001b[49m\u001b[43mepochs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;241;43m3\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m      8\u001b[0m \u001b[43m    \u001b[49m\u001b[43mdimensions\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;241;43m512\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m      9\u001b[0m \u001b[43m    \u001b[49m\u001b[43mrandom_seed\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;241;43m420\u001b[39;49m\n\u001b[0;32m     10\u001b[0m \n\u001b[0;32m     11\u001b[0m \u001b[43m)\u001b[49m\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\pipeline\\api.py:1562\u001b[0m, in \u001b[0;36mpipeline\u001b[1;34m(dataset, dataset_kwargs, training, testing, validation, evaluation_entity_whitelist, evaluation_relation_whitelist, model, model_kwargs, interaction, interaction_kwargs, dimensions, loss, loss_kwargs, regularizer, regularizer_kwargs, optimizer, optimizer_kwargs, clear_optimizer, lr_scheduler, lr_scheduler_kwargs, training_loop, training_loop_kwargs, negative_sampler, negative_sampler_kwargs, epochs, training_kwargs, stopper, stopper_kwargs, evaluator, evaluator_kwargs, evaluation_kwargs, result_tracker, result_tracker_kwargs, metadata, device, random_seed, use_testing_data, evaluation_fallback, filter_validation_when_testing, use_tqdm)\u001b[0m\n\u001b[0;32m   1539\u001b[0m evaluator_instance, evaluation_kwargs \u001b[38;5;241m=\u001b[39m _handle_evaluator(\n\u001b[0;32m   1540\u001b[0m     _result_tracker\u001b[38;5;241m=\u001b[39m_result_tracker,\n\u001b[0;32m   1541\u001b[0m     evaluator\u001b[38;5;241m=\u001b[39mevaluator,\n\u001b[0;32m   1542\u001b[0m     evaluator_kwargs\u001b[38;5;241m=\u001b[39mevaluator_kwargs,\n\u001b[0;32m   1543\u001b[0m     evaluation_kwargs\u001b[38;5;241m=\u001b[39mevaluation_kwargs,\n\u001b[0;32m   1544\u001b[0m )\n\u001b[0;32m   1546\u001b[0m stopper_instance, configuration, losses, train_seconds \u001b[38;5;241m=\u001b[39m _handle_training(\n\u001b[0;32m   1547\u001b[0m     _result_tracker\u001b[38;5;241m=\u001b[39m_result_tracker,\n\u001b[0;32m   1548\u001b[0m     training\u001b[38;5;241m=\u001b[39mtraining,\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   1559\u001b[0m     use_tqdm\u001b[38;5;241m=\u001b[39muse_tqdm,\n\u001b[0;32m   1560\u001b[0m )\n\u001b[1;32m-> 1562\u001b[0m metric_results, evaluate_seconds \u001b[38;5;241m=\u001b[39m \u001b[43m_handle_evaluation\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   1563\u001b[0m \u001b[43m    \u001b[49m\u001b[43m_result_tracker\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43m_result_tracker\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1564\u001b[0m \u001b[43m    \u001b[49m\u001b[43mmodel_instance\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmodel_instance\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1565\u001b[0m \u001b[43m    \u001b[49m\u001b[43mevaluator_instance\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluator_instance\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1566\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstopper_instance\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstopper_instance\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1567\u001b[0m \u001b[43m    \u001b[49m\u001b[43mtraining\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtraining\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1568\u001b[0m \u001b[43m    \u001b[49m\u001b[43mtesting\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtesting\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1569\u001b[0m \u001b[43m    \u001b[49m\u001b[43mvalidation\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mvalidation\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1570\u001b[0m \u001b[43m    \u001b[49m\u001b[43mtraining_kwargs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtraining_kwargs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1571\u001b[0m \u001b[43m    \u001b[49m\u001b[43mevaluation_kwargs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluation_kwargs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1572\u001b[0m \u001b[43m    \u001b[49m\u001b[43muse_testing_data\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43muse_testing_data\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1573\u001b[0m \u001b[43m    \u001b[49m\u001b[43mevaluation_fallback\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluation_fallback\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1574\u001b[0m \u001b[43m    \u001b[49m\u001b[43mfilter_validation_when_testing\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mfilter_validation_when_testing\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1575\u001b[0m \u001b[43m    \u001b[49m\u001b[43muse_tqdm\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43muse_tqdm\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1576\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1577\u001b[0m _result_tracker\u001b[38;5;241m.\u001b[39mend_run()\n\u001b[0;32m   1579\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m PipelineResult(\n\u001b[0;32m   1580\u001b[0m     random_seed\u001b[38;5;241m=\u001b[39m_random_seed,\n\u001b[0;32m   1581\u001b[0m     model\u001b[38;5;241m=\u001b[39mmodel_instance,\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   1590\u001b[0m     evaluate_seconds\u001b[38;5;241m=\u001b[39mevaluate_seconds,\n\u001b[0;32m   1591\u001b[0m )\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\pipeline\\api.py:1286\u001b[0m, in \u001b[0;36m_handle_evaluation\u001b[1;34m(_result_tracker, model_instance, evaluator_instance, stopper_instance, training, testing, validation, training_kwargs, evaluation_kwargs, use_testing_data, evaluation_fallback, filter_validation_when_testing, use_tqdm)\u001b[0m\n\u001b[0;32m   1277\u001b[0m _result_tracker\u001b[38;5;241m.\u001b[39mlog_params(\n\u001b[0;32m   1278\u001b[0m     params\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mdict\u001b[39m(\n\u001b[0;32m   1279\u001b[0m         evaluation_kwargs\u001b[38;5;241m=\u001b[39m{\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   1283\u001b[0m     )\n\u001b[0;32m   1284\u001b[0m )\n\u001b[0;32m   1285\u001b[0m evaluate_start_time \u001b[38;5;241m=\u001b[39m time\u001b[38;5;241m.\u001b[39mtime()\n\u001b[1;32m-> 1286\u001b[0m metric_results: MetricResults \u001b[38;5;241m=\u001b[39m \u001b[43m_safe_evaluate\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   1287\u001b[0m \u001b[43m    \u001b[49m\u001b[43mmodel\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmodel_instance\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1288\u001b[0m \u001b[43m    \u001b[49m\u001b[43mmapped_triples\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmapped_triples\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1289\u001b[0m \u001b[43m    \u001b[49m\u001b[43mevaluator\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluator_instance\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1290\u001b[0m \u001b[43m    \u001b[49m\u001b[43mevaluation_kwargs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluation_kwargs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1291\u001b[0m \u001b[43m    \u001b[49m\u001b[43mevaluation_fallback\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluation_fallback\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1292\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1293\u001b[0m evaluate_end_time \u001b[38;5;241m=\u001b[39m time\u001b[38;5;241m.\u001b[39mtime() \u001b[38;5;241m-\u001b[39m evaluate_start_time\n\u001b[0;32m   1294\u001b[0m step \u001b[38;5;241m=\u001b[39m training_kwargs\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mnum_epochs\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\pipeline\\api.py:1627\u001b[0m, in \u001b[0;36m_safe_evaluate\u001b[1;34m(model, mapped_triples, evaluator, evaluation_kwargs, evaluation_fallback)\u001b[0m\n\u001b[0;32m   1624\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mMemoryError\u001b[39;00m, \u001b[38;5;167;01mRuntimeError\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m   1625\u001b[0m     \u001b[38;5;66;03m# If the evaluation still fail using the CPU, the error is raised\u001b[39;00m\n\u001b[0;32m   1626\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m model\u001b[38;5;241m.\u001b[39mdevice\u001b[38;5;241m.\u001b[39mtype \u001b[38;5;241m!=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcuda\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m evaluation_fallback:\n\u001b[1;32m-> 1627\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m   1629\u001b[0m     \u001b[38;5;66;03m# When the evaluation failed due to OOM on the GPU due to a batch size set too high, the evaluation is\u001b[39;00m\n\u001b[0;32m   1630\u001b[0m     \u001b[38;5;66;03m# restarted with PyKEEN's automatic memory optimization\u001b[39;00m\n\u001b[0;32m   1631\u001b[0m     \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbatch_size\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;129;01min\u001b[39;00m evaluation_kwargs:\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\pipeline\\api.py:1619\u001b[0m, in \u001b[0;36m_safe_evaluate\u001b[1;34m(model, mapped_triples, evaluator, evaluation_kwargs, evaluation_fallback)\u001b[0m\n\u001b[0;32m   1617\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28;01mTrue\u001b[39;00m:\n\u001b[0;32m   1618\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m-> 1619\u001b[0m         metric_results: MetricResults \u001b[38;5;241m=\u001b[39m evaluator\u001b[38;5;241m.\u001b[39mevaluate(\n\u001b[0;32m   1620\u001b[0m             model\u001b[38;5;241m=\u001b[39mmodel,\n\u001b[0;32m   1621\u001b[0m             mapped_triples\u001b[38;5;241m=\u001b[39mmapped_triples,\n\u001b[0;32m   1622\u001b[0m             \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mevaluation_kwargs,\n\u001b[0;32m   1623\u001b[0m         )\n\u001b[0;32m   1624\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (\u001b[38;5;167;01mMemoryError\u001b[39;00m, \u001b[38;5;167;01mRuntimeError\u001b[39;00m) \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m   1625\u001b[0m         \u001b[38;5;66;03m# If the evaluation still fail using the CPU, the error is raised\u001b[39;00m\n\u001b[0;32m   1626\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m model\u001b[38;5;241m.\u001b[39mdevice\u001b[38;5;241m.\u001b[39mtype \u001b[38;5;241m!=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcuda\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m evaluation_fallback:\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\evaluation\\evaluator.py:213\u001b[0m, in \u001b[0;36mEvaluator.evaluate\u001b[1;34m(self, model, mapped_triples, batch_size, slice_size, **kwargs)\u001b[0m\n\u001b[0;32m    210\u001b[0m         \u001b[38;5;66;03m# Clear the ranks from the current evaluator\u001b[39;00m\n\u001b[0;32m    211\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mclear()\n\u001b[1;32m--> 213\u001b[0m rv \u001b[38;5;241m=\u001b[39m evaluate(\n\u001b[0;32m    214\u001b[0m     model\u001b[38;5;241m=\u001b[39mmodel,\n\u001b[0;32m    215\u001b[0m     mapped_triples\u001b[38;5;241m=\u001b[39mmapped_triples,\n\u001b[0;32m    216\u001b[0m     evaluator\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m,\n\u001b[0;32m    217\u001b[0m     batch_size\u001b[38;5;241m=\u001b[39mbatch_size,\n\u001b[0;32m    218\u001b[0m     slice_size\u001b[38;5;241m=\u001b[39mslice_size,\n\u001b[0;32m    219\u001b[0m     \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs,\n\u001b[0;32m    220\u001b[0m )\n\u001b[0;32m    221\u001b[0m \u001b[38;5;66;03m# Since squeeze is true, we can expect that evaluate returns a MetricResult, but we need to tell MyPy that\u001b[39;00m\n\u001b[0;32m    222\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m cast(MetricResults, rv)\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\evaluation\\evaluator.py:687\u001b[0m, in \u001b[0;36mevaluate\u001b[1;34m(model, mapped_triples, evaluator, only_size_probing, batch_size, slice_size, device, use_tqdm, tqdm_kwargs, restrict_entities_to, restrict_relations_to, do_time_consuming_checks, additional_filter_triples, pre_filtered_triples, targets, mode)\u001b[0m\n\u001b[0;32m    685\u001b[0m relation_filter \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[0;32m    686\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m target \u001b[38;5;129;01min\u001b[39;00m targets:\n\u001b[1;32m--> 687\u001b[0m     relation_filter \u001b[38;5;241m=\u001b[39m \u001b[43m_evaluate_batch\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    688\u001b[0m \u001b[43m        \u001b[49m\u001b[43mbatch\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mbatch\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    689\u001b[0m \u001b[43m        \u001b[49m\u001b[43mmodel\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmodel\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    690\u001b[0m \u001b[43m        \u001b[49m\u001b[43mtarget\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtarget\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    691\u001b[0m \u001b[43m        \u001b[49m\u001b[43mevaluator\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mevaluator\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    692\u001b[0m \u001b[43m        \u001b[49m\u001b[43mslice_size\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mslice_size\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    693\u001b[0m \u001b[43m        \u001b[49m\u001b[43mall_pos_triples\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mall_pos_triples\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    694\u001b[0m \u001b[43m        \u001b[49m\u001b[43mrelation_filter\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrelation_filter\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    695\u001b[0m \u001b[43m        \u001b[49m\u001b[43mrestrict_entities_to\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrestrict_entities_to\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    696\u001b[0m \u001b[43m        \u001b[49m\u001b[43mmode\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    697\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    699\u001b[0m \u001b[38;5;66;03m# If we only probe sizes we do not need more than one batch\u001b[39;00m\n\u001b[0;32m    700\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m only_size_probing \u001b[38;5;129;01mand\u001b[39;00m evaluated_once:\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\evaluation\\evaluator.py:760\u001b[0m, in \u001b[0;36m_evaluate_batch\u001b[1;34m(batch, model, target, evaluator, slice_size, all_pos_triples, relation_filter, restrict_entities_to, mode)\u001b[0m\n\u001b[0;32m    720\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21m_evaluate_batch\u001b[39m(\n\u001b[0;32m    721\u001b[0m     batch: MappedTriples,\n\u001b[0;32m    722\u001b[0m     model: Model,\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    730\u001b[0m     mode: Optional[InductiveMode],\n\u001b[0;32m    731\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m torch\u001b[38;5;241m.\u001b[39mBoolTensor:\n\u001b[0;32m    732\u001b[0m     \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[0;32m    733\u001b[0m \u001b[38;5;124;03m    Evaluate ranking for batch.\u001b[39;00m\n\u001b[0;32m    734\u001b[0m \n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    758\u001b[0m \u001b[38;5;124;03m        The relation filter, which can be re-used for the same batch.\u001b[39;00m\n\u001b[0;32m    759\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[1;32m--> 760\u001b[0m     scores \u001b[38;5;241m=\u001b[39m \u001b[43mmodel\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpredict\u001b[49m\u001b[43m(\u001b[49m\u001b[43mhrt_batch\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mbatch\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtarget\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtarget\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mslice_size\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mslice_size\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmode\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmode\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    762\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m evaluator\u001b[38;5;241m.\u001b[39mfiltered \u001b[38;5;129;01mor\u001b[39;00m evaluator\u001b[38;5;241m.\u001b[39mrequires_positive_mask:\n\u001b[0;32m    763\u001b[0m         column \u001b[38;5;241m=\u001b[39m TARGET_TO_INDEX[target]\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\models\\base.py:481\u001b[0m, in \u001b[0;36mModel.predict\u001b[1;34m(self, hrt_batch, target, full_batch, ids, **kwargs)\u001b[0m\n\u001b[0;32m    479\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m full_batch:\n\u001b[0;32m    480\u001b[0m         hrt_batch \u001b[38;5;241m=\u001b[39m hrt_batch[:, \u001b[38;5;241m1\u001b[39m:\u001b[38;5;241m3\u001b[39m]\n\u001b[1;32m--> 481\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpredict_h(hrt_batch, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs, heads\u001b[38;5;241m=\u001b[39mids)\n\u001b[0;32m    483\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mUnknown target=\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mtarget\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\models\\base.py:374\u001b[0m, in \u001b[0;36mModel.predict_h\u001b[1;34m(self, rt_batch, **kwargs)\u001b[0m\n\u001b[0;32m    372\u001b[0m     scores \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mscore_h_inverse(rt_batch\u001b[38;5;241m=\u001b[39mrt_batch, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    373\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m--> 374\u001b[0m     scores \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mscore_h(rt_batch, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    375\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpredict_with_sigmoid:\n\u001b[0;32m    376\u001b[0m     scores \u001b[38;5;241m=\u001b[39m torch\u001b[38;5;241m.\u001b[39msigmoid(scores)\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\models\\nbase.py:527\u001b[0m, in \u001b[0;36mERModel.score_h\u001b[1;34m(self, rt_batch, slice_size, mode, heads)\u001b[0m\n\u001b[0;32m    524\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m heads \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m \u001b[38;5;129;01mor\u001b[39;00m heads\u001b[38;5;241m.\u001b[39mndimension() \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m1\u001b[39m:\n\u001b[0;32m    525\u001b[0m     h \u001b[38;5;241m=\u001b[39m parallel_unsqueeze(h, dim\u001b[38;5;241m=\u001b[39m\u001b[38;5;241m0\u001b[39m)\n\u001b[0;32m    526\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m repeat_if_necessary(\n\u001b[1;32m--> 527\u001b[0m     scores\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minteraction\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mscore\u001b[49m\u001b[43m(\u001b[49m\u001b[43mh\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mh\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mr\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mr\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mt\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mt\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mslice_size\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mslice_size\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mslice_dim\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m)\u001b[49m,\n\u001b[0;32m    528\u001b[0m     representations\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mentity_representations,\n\u001b[0;32m    529\u001b[0m     num\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_get_entity_len(mode\u001b[38;5;241m=\u001b[39mmode) \u001b[38;5;28;01mif\u001b[39;00m heads \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m \u001b[38;5;28;01melse\u001b[39;00m heads\u001b[38;5;241m.\u001b[39mshape[\u001b[38;5;241m-\u001b[39m\u001b[38;5;241m1\u001b[39m],\n\u001b[0;32m    530\u001b[0m )\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\nn\\modules.py:265\u001b[0m, in \u001b[0;36mInteraction.score\u001b[1;34m(self, h, r, t, slice_size, slice_dim)\u001b[0m\n\u001b[0;32m    243\u001b[0m \u001b[38;5;124;03m\"\"\"Compute broadcasted triple scores with optional slicing.\u001b[39;00m\n\u001b[0;32m    244\u001b[0m \n\u001b[0;32m    245\u001b[0m \u001b[38;5;124;03m.. note ::\u001b[39;00m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    262\u001b[0m \u001b[38;5;124;03m    The scores.\u001b[39;00m\n\u001b[0;32m    263\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[0;32m    264\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m slice_size \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[1;32m--> 265\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mh\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mh\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mr\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mr\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mt\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mt\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    267\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m torch\u001b[38;5;241m.\u001b[39mcat(\n\u001b[0;32m    268\u001b[0m     [\n\u001b[0;32m    269\u001b[0m         \u001b[38;5;28mself\u001b[39m(h\u001b[38;5;241m=\u001b[39mh_batch, r\u001b[38;5;241m=\u001b[39mr_batch, t\u001b[38;5;241m=\u001b[39mt_batch)\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    272\u001b[0m     dim\u001b[38;5;241m=\u001b[39mslice_dim,\n\u001b[0;32m    273\u001b[0m )\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\torch\\nn\\modules\\module.py:1501\u001b[0m, in \u001b[0;36mModule._call_impl\u001b[1;34m(self, *args, **kwargs)\u001b[0m\n\u001b[0;32m   1496\u001b[0m \u001b[38;5;66;03m# If we don't have any hooks, we want to skip the rest of the logic in\u001b[39;00m\n\u001b[0;32m   1497\u001b[0m \u001b[38;5;66;03m# this function, and just call forward.\u001b[39;00m\n\u001b[0;32m   1498\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m (\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_backward_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_backward_pre_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_forward_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_forward_pre_hooks\n\u001b[0;32m   1499\u001b[0m         \u001b[38;5;129;01mor\u001b[39;00m _global_backward_pre_hooks \u001b[38;5;129;01mor\u001b[39;00m _global_backward_hooks\n\u001b[0;32m   1500\u001b[0m         \u001b[38;5;129;01mor\u001b[39;00m _global_forward_hooks \u001b[38;5;129;01mor\u001b[39;00m _global_forward_pre_hooks):\n\u001b[1;32m-> 1501\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m forward_call(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m   1502\u001b[0m \u001b[38;5;66;03m# Do not call functions when jit is used\u001b[39;00m\n\u001b[0;32m   1503\u001b[0m full_backward_hooks, non_full_backward_hooks \u001b[38;5;241m=\u001b[39m [], []\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\nn\\modules.py:412\u001b[0m, in \u001b[0;36mFunctionalInteraction.forward\u001b[1;34m(self, h, r, t)\u001b[0m\n\u001b[0;32m    394\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mforward\u001b[39m(\n\u001b[0;32m    395\u001b[0m     \u001b[38;5;28mself\u001b[39m,\n\u001b[0;32m    396\u001b[0m     h: HeadRepresentation,\n\u001b[0;32m    397\u001b[0m     r: RelationRepresentation,\n\u001b[0;32m    398\u001b[0m     t: TailRepresentation,\n\u001b[0;32m    399\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m torch\u001b[38;5;241m.\u001b[39mFloatTensor:\n\u001b[0;32m    400\u001b[0m     \u001b[38;5;124;03m\"\"\"Compute broadcasted triple scores given broadcasted representations for head, relation and tails.\u001b[39;00m\n\u001b[0;32m    401\u001b[0m \n\u001b[0;32m    402\u001b[0m \u001b[38;5;124;03m    :param h: shape: (`*batch_dims`, `*dims`)\u001b[39;00m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    410\u001b[0m \u001b[38;5;124;03m        The scores.\u001b[39;00m\n\u001b[0;32m    411\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[1;32m--> 412\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m\u001b[38;5;18m__class__\u001b[39m\u001b[38;5;241m.\u001b[39mfunc(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_prepare_for_functional(h\u001b[38;5;241m=\u001b[39mh, r\u001b[38;5;241m=\u001b[39mr, t\u001b[38;5;241m=\u001b[39mt))\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\nn\\functional.py:93\u001b[0m, in \u001b[0;36m_add_cuda_warning.<locals>.wrapped\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m     91\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mRuntimeError\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m     92\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m is_cudnn_error(e):\n\u001b[1;32m---> 93\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m     94\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mRuntimeError\u001b[39;00m(\n\u001b[0;32m     95\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124mThis code crash might have been caused by a CUDA bug, see \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m     96\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mhttps://github.com/allenai/allennlp/issues/2888, \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m     97\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mwhich causes the code to crash during evaluation mode.\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m     98\u001b[0m         \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mTo avoid this error, the batch size has to be reduced.\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[0;32m     99\u001b[0m     ) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01me\u001b[39;00m\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\nn\\functional.py:90\u001b[0m, in \u001b[0;36m_add_cuda_warning.<locals>.wrapped\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m     87\u001b[0m \u001b[38;5;129m@functools\u001b[39m\u001b[38;5;241m.\u001b[39mwraps(func)\n\u001b[0;32m     88\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mwrapped\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m     89\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m---> 90\u001b[0m         \u001b[38;5;28;01mreturn\u001b[39;00m func(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m     91\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mRuntimeError\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m     92\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m is_cudnn_error(e):\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\pykeen\\nn\\functional.py:153\u001b[0m, in \u001b[0;36mconve_interaction\u001b[1;34m(h, r, t, t_bias, input_channels, embedding_height, embedding_width, hr2d, hr1d)\u001b[0m\n\u001b[0;32m    150\u001b[0m x \u001b[38;5;241m=\u001b[39m x\u001b[38;5;241m.\u001b[39mview(\u001b[38;5;241m-\u001b[39m\u001b[38;5;241m1\u001b[39m, input_channels, \u001b[38;5;241m2\u001b[39m \u001b[38;5;241m*\u001b[39m embedding_height, embedding_width)\n\u001b[0;32m    152\u001b[0m \u001b[38;5;66;03m# shape: -1, num_input_channels, 2*height, width\u001b[39;00m\n\u001b[1;32m--> 153\u001b[0m x \u001b[38;5;241m=\u001b[39m \u001b[43mhr2d\u001b[49m\u001b[43m(\u001b[49m\u001b[43mx\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    155\u001b[0m \u001b[38;5;66;03m# -1, num_output_channels * (2 * height - kernel_height + 1) * (width - kernel_width + 1)\u001b[39;00m\n\u001b[0;32m    156\u001b[0m x \u001b[38;5;241m=\u001b[39m x\u001b[38;5;241m.\u001b[39mview(\u001b[38;5;241m-\u001b[39m\u001b[38;5;241m1\u001b[39m, numpy\u001b[38;5;241m.\u001b[39mprod(x\u001b[38;5;241m.\u001b[39mshape[\u001b[38;5;241m-\u001b[39m\u001b[38;5;241m3\u001b[39m:]))\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\torch\\nn\\modules\\module.py:1501\u001b[0m, in \u001b[0;36mModule._call_impl\u001b[1;34m(self, *args, **kwargs)\u001b[0m\n\u001b[0;32m   1496\u001b[0m \u001b[38;5;66;03m# If we don't have any hooks, we want to skip the rest of the logic in\u001b[39;00m\n\u001b[0;32m   1497\u001b[0m \u001b[38;5;66;03m# this function, and just call forward.\u001b[39;00m\n\u001b[0;32m   1498\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m (\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_backward_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_backward_pre_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_forward_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_forward_pre_hooks\n\u001b[0;32m   1499\u001b[0m         \u001b[38;5;129;01mor\u001b[39;00m _global_backward_pre_hooks \u001b[38;5;129;01mor\u001b[39;00m _global_backward_hooks\n\u001b[0;32m   1500\u001b[0m         \u001b[38;5;129;01mor\u001b[39;00m _global_forward_hooks \u001b[38;5;129;01mor\u001b[39;00m _global_forward_pre_hooks):\n\u001b[1;32m-> 1501\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m forward_call(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m   1502\u001b[0m \u001b[38;5;66;03m# Do not call functions when jit is used\u001b[39;00m\n\u001b[0;32m   1503\u001b[0m full_backward_hooks, non_full_backward_hooks \u001b[38;5;241m=\u001b[39m [], []\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\torch\\nn\\modules\\container.py:217\u001b[0m, in \u001b[0;36mSequential.forward\u001b[1;34m(self, input)\u001b[0m\n\u001b[0;32m    215\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mforward\u001b[39m(\u001b[38;5;28mself\u001b[39m, \u001b[38;5;28minput\u001b[39m):\n\u001b[0;32m    216\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m module \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m:\n\u001b[1;32m--> 217\u001b[0m         \u001b[38;5;28minput\u001b[39m \u001b[38;5;241m=\u001b[39m \u001b[43mmodule\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[0;32m    218\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28minput\u001b[39m\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\torch\\nn\\modules\\module.py:1501\u001b[0m, in \u001b[0;36mModule._call_impl\u001b[1;34m(self, *args, **kwargs)\u001b[0m\n\u001b[0;32m   1496\u001b[0m \u001b[38;5;66;03m# If we don't have any hooks, we want to skip the rest of the logic in\u001b[39;00m\n\u001b[0;32m   1497\u001b[0m \u001b[38;5;66;03m# this function, and just call forward.\u001b[39;00m\n\u001b[0;32m   1498\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m (\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_backward_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_backward_pre_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_forward_hooks \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_forward_pre_hooks\n\u001b[0;32m   1499\u001b[0m         \u001b[38;5;129;01mor\u001b[39;00m _global_backward_pre_hooks \u001b[38;5;129;01mor\u001b[39;00m _global_backward_hooks\n\u001b[0;32m   1500\u001b[0m         \u001b[38;5;129;01mor\u001b[39;00m _global_forward_hooks \u001b[38;5;129;01mor\u001b[39;00m _global_forward_pre_hooks):\n\u001b[1;32m-> 1501\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m forward_call(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m   1502\u001b[0m \u001b[38;5;66;03m# Do not call functions when jit is used\u001b[39;00m\n\u001b[0;32m   1503\u001b[0m full_backward_hooks, non_full_backward_hooks \u001b[38;5;241m=\u001b[39m [], []\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\torch\\nn\\modules\\conv.py:463\u001b[0m, in \u001b[0;36mConv2d.forward\u001b[1;34m(self, input)\u001b[0m\n\u001b[0;32m    462\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mforward\u001b[39m(\u001b[38;5;28mself\u001b[39m, \u001b[38;5;28minput\u001b[39m: Tensor) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m Tensor:\n\u001b[1;32m--> 463\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_conv_forward\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mweight\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mbias\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32m~\\anaconda3\\lib\\site-packages\\torch\\nn\\modules\\conv.py:459\u001b[0m, in \u001b[0;36mConv2d._conv_forward\u001b[1;34m(self, input, weight, bias)\u001b[0m\n\u001b[0;32m    455\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpadding_mode \u001b[38;5;241m!=\u001b[39m \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mzeros\u001b[39m\u001b[38;5;124m'\u001b[39m:\n\u001b[0;32m    456\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m F\u001b[38;5;241m.\u001b[39mconv2d(F\u001b[38;5;241m.\u001b[39mpad(\u001b[38;5;28minput\u001b[39m, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_reversed_padding_repeated_twice, mode\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpadding_mode),\n\u001b[0;32m    457\u001b[0m                     weight, bias, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mstride,\n\u001b[0;32m    458\u001b[0m                     _pair(\u001b[38;5;241m0\u001b[39m), \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mdilation, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mgroups)\n\u001b[1;32m--> 459\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mF\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconv2d\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mweight\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mbias\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mstride\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    460\u001b[0m \u001b[43m                \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpadding\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdilation\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgroups\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[1;31mRuntimeError\u001b[0m: [enforce fail at ..\\c10\\core\\impl\\alloc_cpu.cpp:72] data. DefaultCPUAllocator: not enough memory: you tried to allocate 26449182720 bytes."
     ]
    }
   ],
   "source": [
    "result3 = pipeline(\n",
    "    training=training,\n",
    "    testing=testing,\n",
    "    validation=validation,\n",
    "    model='ConvE',\n",
    "    stopper='early',\n",
    "    epochs=3,\n",
    "    dimensions=512,\n",
    "    random_seed=420\n",
    "\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "368353e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:pykeen.triples.triples_factory:Stored TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172) to file:///C:/Users/shubh/Downloads/result_complex/training_triples\n",
      "INFO:pykeen.pipeline.api:Saved to directory: file:///C:/Users/shubh/Downloads/result_complex\n",
      "INFO:pykeen.triples.triples_factory:Stored TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172) to file:///C:/Users/shubh/Downloads/result_transe/training_triples\n",
      "INFO:pykeen.pipeline.api:Saved to directory: file:///C:/Users/shubh/Downloads/result_transe\n"
     ]
    }
   ],
   "source": [
    "result.save_to_directory('result_complex')\n",
    "result2.save_to_directory('result_transe')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "5e6998d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pykeen.predict import predict_target"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "44971b7a",
   "metadata": {},
   "source": [
    "# USECASE 1 : Upregulated genes prediction for Breast Cancer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 272,
   "id": "0afd9547",
   "metadata": {},
   "outputs": [],
   "source": [
    "disease_id = run_query(\"\"\"\n",
    "MATCH (s:Disease)\n",
    "WHERE s.name = \"breast cancer\"\n",
    "RETURN toString(id(s)) as id\n",
    "\"\"\")['id'][0]\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "id": "f6834fae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'3099'"
      ]
     },
     "execution_count": 273,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "disease_id"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34f99ad2",
   "metadata": {},
   "source": [
    "### Analysis using ComplEx model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "id": "f53a5eec",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred = predict_target(\n",
    "    model=result.model,\n",
    "    head=disease_id,\n",
    "    relation=\"upregulates\",\n",
    "    triples_factory=result.training,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "id": "18203756",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id      score tail_label\n",
       "2758      2758  59.933502      12834\n",
       "18403    18403  59.775108       8448\n",
       "10648    10648  56.862106      20901\n",
       "14218    14218  55.041542       4178\n",
       "8279      8279  54.862183       1849\n",
       "...        ...        ...        ...\n",
       "10300    10300 -58.386963      20547\n",
       "2636      2636 -58.652962      12707\n",
       "4389      4389 -59.824844        145\n",
       "3433      3433 -61.008022      13535\n",
       "5323      5323 -61.487949      15467\n",
       "\n",
       "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 275,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "id": "69c64b8a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id      score tail_label\n",
       "2758      2758  59.933502      12834\n",
       "18403    18403  59.775108       8448\n",
       "10648    10648  56.862106      20901\n",
       "14218    14218  55.041542       4178\n",
       "8279      8279  54.862183       1849\n",
       "...        ...        ...        ...\n",
       "10300    10300 -58.386963      20547\n",
       "2636      2636 -58.652962      12707\n",
       "4389      4389 -59.824844        145\n",
       "3433      3433 -61.008022      13535\n",
       "5323      5323 -61.487949      15467\n",
       "\n",
       "[19724 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 276,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered = pred.filter_triples(training)\n",
    "pred_filtered"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "id": "9adde8e7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id      score tail_label  in_training  in_validation  in_testing\n",
       "2758      2758  59.933502      12834        False          False       False\n",
       "18403    18403  59.775108       8448        False          False       False\n",
       "10648    10648  56.862106      20901        False          False       False\n",
       "14218    14218  55.041542       4178        False          False       False\n",
       "8279      8279  54.862183       1849        False          False       False\n",
       "...        ...        ...        ...          ...            ...         ...\n",
       "10300    10300 -58.386963      20547        False          False       False\n",
       "2636      2636 -58.652962      12707        False          False       False\n",
       "4389      4389 -59.824844        145        False          False       False\n",
       "3433      3433 -61.008022      13535        False          False       False\n",
       "5323      5323 -61.487949      15467        False          False       False\n",
       "\n",
       "[19724 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 277,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated = pred_filtered.add_membership_columns(training=training, validation=validation, testing=testing)\n",
    "pred_annotated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "id": "5ead52b2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>tail_id</th>\n",
       "      <th>score</th>\n",
       "      <th>tail_label</th>\n",
       "      <th>in_training</th>\n",
       "      <th>in_validation</th>\n",
       "      <th>in_testing</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2758</th>\n",
       "      <td>2758</td>\n",
       "      <td>59.933502</td>\n",
       "      <td>12834</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18403</th>\n",
       "      <td>18403</td>\n",
       "      <td>59.775108</td>\n",
       "      <td>8448</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10648</th>\n",
       "      <td>10648</td>\n",
       "      <td>56.862106</td>\n",
       "      <td>20901</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14218</th>\n",
       "      <td>14218</td>\n",
       "      <td>55.041542</td>\n",
       "      <td>4178</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8279</th>\n",
       "      <td>8279</td>\n",
       "      <td>54.862183</td>\n",
       "      <td>1849</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10300</th>\n",
       "      <td>10300</td>\n",
       "      <td>-58.386963</td>\n",
       "      <td>20547</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2636</th>\n",
       "      <td>2636</td>\n",
       "      <td>-58.652962</td>\n",
       "      <td>12707</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4389</th>\n",
       "      <td>4389</td>\n",
       "      <td>-59.824844</td>\n",
       "      <td>145</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3433</th>\n",
       "      <td>3433</td>\n",
       "      <td>-61.008022</td>\n",
       "      <td>13535</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5323</th>\n",
       "      <td>5323</td>\n",
       "      <td>-61.487949</td>\n",
       "      <td>15467</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>19724 rows  6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       tail_id      score tail_label  in_training  in_validation  in_testing\n",
       "2758      2758  59.933502      12834        False          False       False\n",
       "18403    18403  59.775108       8448        False          False       False\n",
       "10648    10648  56.862106      20901        False          False       False\n",
       "14218    14218  55.041542       4178        False          False       False\n",
       "8279      8279  54.862183       1849        False          False       False\n",
       "...        ...        ...        ...          ...            ...         ...\n",
       "10300    10300 -58.386963      20547        False          False       False\n",
       "2636      2636 -58.652962      12707        False          False       False\n",
       "4389      4389 -59.824844        145        False          False       False\n",
       "3433      3433 -61.008022      13535        False          False       False\n",
       "5323      5323 -61.487949      15467        False          False       False\n",
       "\n",
       "[19724 rows x 6 columns]"
      ]
     },
     "execution_count": 279,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pred_annotated.df\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "id": "709a8904",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['12834', '8448', '20901', '4178', '1849', '20929', '3750', '14295', '6213', '5033', '10884', '16716', '7467', '22414', '1553', '13515', '13850', '47', '19972', '13176', '19846', '6672', '14914', '6098', '16141', '10331', '17094', '16839', '5353', '7931', '8264', '655', '10953', '17914', '10828', '7491', '16488', '10506', '11053', '1241', '11333', '13751', '19393', '8340', '15008', '4252', '19739', '7688', '22252', '12429']\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 280,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "candidate_nodes = df[df['in_training'] == False].head(50)['tail_label'].to_list()\n",
    "print(candidate_nodes)\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($disease_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca)\n",
    "MERGE (n)-[:upregulates_C1]->(c)\n",
    "\"\"\", {'disease_id':disease_id, 'candidates': candidate_nodes})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 281,
   "id": "1a003744",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Gene</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ZBTB22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>COL11A2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TBX19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GRPEL2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>OR51E1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SEC23A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PRG3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SMOX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>IGHMBP2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PPM1A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>FOXN4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ECI1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ABCA4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>WAC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PRAMEF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SALL4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TNFSF4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>JMJD4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GGA1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SGPP1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>STAC2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DDX4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ZNF317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>COPS3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>KCNRG</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>INSIG1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ATRX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HACL1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CYP46A1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TCEB2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MAPK15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>C2orf78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SYCN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CLDN19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>BSG</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>FAM86B1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CYTH1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>AUH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ADRM1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>POMK</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TMEM74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DNAJC17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SMIM4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TMEM185A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GPX2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          Disease      Gene\n",
       "0   breast cancer    ZBTB22\n",
       "1   breast cancer   COL11A2\n",
       "2   breast cancer     TBX19\n",
       "3   breast cancer    GRPEL2\n",
       "4   breast cancer    OR51E1\n",
       "5   breast cancer    SEC23A\n",
       "6   breast cancer      PRG3\n",
       "7   breast cancer      SMOX\n",
       "8   breast cancer   IGHMBP2\n",
       "9   breast cancer     PPM1A\n",
       "10  breast cancer     FOXN4\n",
       "11  breast cancer      ECI1\n",
       "12  breast cancer     ABCA4\n",
       "13  breast cancer       WAC\n",
       "14  breast cancer   PRAMEF1\n",
       "15  breast cancer     SALL4\n",
       "16  breast cancer    TNFSF4\n",
       "17  breast cancer     JMJD4\n",
       "18  breast cancer      GGA1\n",
       "19  breast cancer     SGPP1\n",
       "20  breast cancer     STAC2\n",
       "21  breast cancer      DDX4\n",
       "22  breast cancer    ZNF317\n",
       "23  breast cancer     COPS3\n",
       "24  breast cancer     KCNRG\n",
       "25  breast cancer    INSIG1\n",
       "26  breast cancer      ATRX\n",
       "27  breast cancer     HACL1\n",
       "28  breast cancer   CYP46A1\n",
       "29  breast cancer     TCEB2\n",
       "30  breast cancer    MAPK15\n",
       "31  breast cancer   C2orf78\n",
       "32  breast cancer      SYCN\n",
       "33  breast cancer    CLDN19\n",
       "34  breast cancer       BSG\n",
       "35  breast cancer   FAM86B1\n",
       "36  breast cancer     CYTH1\n",
       "37  breast cancer       AUH\n",
       "38  breast cancer     ADRM1\n",
       "39  breast cancer      POMK\n",
       "40  breast cancer    TMEM74\n",
       "41  breast cancer   DNAJC17\n",
       "42  breast cancer     SMIM4\n",
       "43  breast cancer  TMEM185A\n",
       "44  breast cancer      GPX2"
      ]
     },
     "execution_count": 281,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease)-[:upregulates_C1]->(d:Gene)\n",
    "RETURN c.name as Disease, d.name as Gene\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 282,
   "id": "54a540c7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, PIN1, ZBTB22]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        [n in nodes(p) | n.name]\n",
       "0  [breast cancer, PIN1, ZBTB22]"
      ]
     },
     "execution_count": 282,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene {name:\"ZBTB22\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 288,
   "id": "a2c89c1d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, HSP90AA1, DDR2, COL11A2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[breast cancer, SRC, DDR2, COL11A2]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   [n in nodes(p) | n.name]\n",
       "0  [breast cancer, HSP90AA1, DDR2, COL11A2]\n",
       "1       [breast cancer, SRC, DDR2, COL11A2]"
      ]
     },
     "execution_count": 288,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene {name:\"COL11A2\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 289,
   "id": "af835ce0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, AR, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[breast cancer, BARD1, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[breast cancer, NCOA1, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[breast cancer, NRIP1, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[breast cancer, TRERF1, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[breast cancer, JUN, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[breast cancer, CTNNB1, NR5A1, TBX19]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                [n in nodes(p) | n.name]\n",
       "0      [breast cancer, AR, NR5A1, TBX19]\n",
       "1   [breast cancer, BARD1, NR5A1, TBX19]\n",
       "2   [breast cancer, NCOA1, NR5A1, TBX19]\n",
       "3   [breast cancer, NRIP1, NR5A1, TBX19]\n",
       "4  [breast cancer, TRERF1, NR5A1, TBX19]\n",
       "5     [breast cancer, JUN, NR5A1, TBX19]\n",
       "6  [breast cancer, CTNNB1, NR5A1, TBX19]"
      ]
     },
     "execution_count": 289,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene {name:\"TBX19\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9c896603",
   "metadata": {},
   "source": [
    "### Analysis using TransE model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 290,
   "id": "e02be8df",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred2 = predict_target(\n",
    "    model=result2.model,\n",
    "    head=disease_id,\n",
    "    relation=\"upregulates\",\n",
    "    triples_factory=result2.training,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 291,
   "id": "185939f0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id      score tail_label\n",
       "4236      4236  -7.233153      14346\n",
       "8449      8449  -7.405909      18659\n",
       "11541    11541  -7.448671      21807\n",
       "10104    10104  -7.582721      20354\n",
       "17244    17244  -7.628639       7273\n",
       "...        ...        ...        ...\n",
       "14747    14747 -14.162211       4719\n",
       "6959      6959 -14.169616      17133\n",
       "12908    12908 -14.182336        283\n",
       "12123    12123 -14.255861      22395\n",
       "19079    19079 -14.690176        913\n",
       "\n",
       "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 291,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 292,
   "id": "a95494cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id      score tail_label\n",
       "4236      4236  -7.233153      14346\n",
       "8449      8449  -7.405909      18659\n",
       "11541    11541  -7.448671      21807\n",
       "10104    10104  -7.582721      20354\n",
       "17244    17244  -7.628639       7273\n",
       "...        ...        ...        ...\n",
       "14747    14747 -14.162211       4719\n",
       "6959      6959 -14.169616      17133\n",
       "12908    12908 -14.182336        283\n",
       "12123    12123 -14.255861      22395\n",
       "19079    19079 -14.690176        913\n",
       "\n",
       "[19724 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 292,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered2 = pred2.filter_triples(training)\n",
    "pred_filtered2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 293,
   "id": "84761728",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       tail_id      score tail_label  in_training  in_validation  in_testing\n",
       "4236      4236  -7.233153      14346        False          False       False\n",
       "8449      8449  -7.405909      18659        False          False       False\n",
       "11541    11541  -7.448671      21807        False          False       False\n",
       "10104    10104  -7.582721      20354        False          False       False\n",
       "17244    17244  -7.628639       7273        False          False       False\n",
       "...        ...        ...        ...          ...            ...         ...\n",
       "14747    14747 -14.162211       4719        False          False       False\n",
       "6959      6959 -14.169616      17133        False          False       False\n",
       "12908    12908 -14.182336        283        False          False       False\n",
       "12123    12123 -14.255861      22395        False          False       False\n",
       "19079    19079 -14.690176        913        False          False       False\n",
       "\n",
       "[19724 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='tail', other_columns_fixed_ids=(13167, 9))"
      ]
     },
     "execution_count": 293,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated2 = pred_filtered2.add_membership_columns(training=training, validation=validation, testing=testing)\n",
    "pred_annotated2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 294,
   "id": "c6b070bb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 294,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df2 = pred_annotated2.df\n",
    "\n",
    "candidate_nodes2 = df2[df2['in_training'] == False].head(50)['tail_label'].to_list()\n",
    "\n",
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($disease_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca)\n",
    "MERGE (n)-[:upregulates_T1]->(c)\n",
    "\"\"\", {'disease_id':disease_id, 'candidates': candidate_nodes2})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 295,
   "id": "752dfb83",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Gene</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TSC22D3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>LBR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SLC35B1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>STUB1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DYNLT3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HACD3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ANKRA2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PPP4C</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TRIB3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CLPX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MVP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CD40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TIMM9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CD320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PPARD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>BLVRA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>MTHFD2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SOCS2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>YBX3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>GDF15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>ARHGEF2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TUBB6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>NUP85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PGRMC1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PTK2B</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>AARS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>KAT2A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CCND3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CHIC2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>SQSTM1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>IFNAR1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>INSIG1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HMGCR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RPS4Y1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TGFB3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DDIT4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>RPA1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>UBQLN2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>COG4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CDK6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>LAMA3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>DDX10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TXLNA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CNPY3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>HIF1A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>IRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>PFN1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>TUBA1A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>CCNE2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>breast cancer</td>\n",
       "      <td>IGFBP3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          Disease     Gene\n",
       "0   breast cancer  TSC22D3\n",
       "1   breast cancer      LBR\n",
       "2   breast cancer  SLC35B1\n",
       "3   breast cancer    STUB1\n",
       "4   breast cancer   DYNLT3\n",
       "5   breast cancer    HACD3\n",
       "6   breast cancer   ANKRA2\n",
       "7   breast cancer    PPP4C\n",
       "8   breast cancer    TRIB3\n",
       "9   breast cancer     CLPX\n",
       "10  breast cancer      MVP\n",
       "11  breast cancer     CD40\n",
       "12  breast cancer    TIMM9\n",
       "13  breast cancer    CD320\n",
       "14  breast cancer    PPARD\n",
       "15  breast cancer    BLVRA\n",
       "16  breast cancer   MTHFD2\n",
       "17  breast cancer    SOCS2\n",
       "18  breast cancer     YBX3\n",
       "19  breast cancer    GDF15\n",
       "20  breast cancer  ARHGEF2\n",
       "21  breast cancer    TUBB6\n",
       "22  breast cancer    NUP85\n",
       "23  breast cancer   PGRMC1\n",
       "24  breast cancer    PTK2B\n",
       "25  breast cancer     AARS\n",
       "26  breast cancer    KAT2A\n",
       "27  breast cancer    CCND3\n",
       "28  breast cancer    CHIC2\n",
       "29  breast cancer   SQSTM1\n",
       "30  breast cancer   IFNAR1\n",
       "31  breast cancer   INSIG1\n",
       "32  breast cancer    HMGCR\n",
       "33  breast cancer   RPS4Y1\n",
       "34  breast cancer    TGFB3\n",
       "35  breast cancer    DDIT4\n",
       "36  breast cancer     RPA1\n",
       "37  breast cancer   UBQLN2\n",
       "38  breast cancer     COG4\n",
       "39  breast cancer     CDK6\n",
       "40  breast cancer    LAMA3\n",
       "41  breast cancer    DDX10\n",
       "42  breast cancer    TXLNA\n",
       "43  breast cancer    CNPY3\n",
       "44  breast cancer    HIF1A\n",
       "45  breast cancer     IRF1\n",
       "46  breast cancer     PFN1\n",
       "47  breast cancer   TUBA1A\n",
       "48  breast cancer    CCNE2\n",
       "49  breast cancer   IGFBP3"
      ]
     },
     "execution_count": 295,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease)-[:upregulates_T1]->(d:Gene)\n",
    "RETURN c.name as Disease, d.name as Gene\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 297,
   "id": "737b74e1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, GPI, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[breast cancer, HSPA1B, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[breast cancer, KCNN4, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[breast cancer, TFRC, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[breast cancer, HIST1H2BK, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[breast cancer, FOXQ1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[breast cancer, KRT8, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[breast cancer, AHR, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[breast cancer, SPRY1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[breast cancer, RARB, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[breast cancer, FHL2, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[breast cancer, BABAM1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[breast cancer, F3, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[breast cancer, SRC, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[breast cancer, NR2F6, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[breast cancer, IGF1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[breast cancer, LSP1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[breast cancer, ALDOA, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[breast cancer, FGFR2, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[breast cancer, E2F1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[breast cancer, ARAF, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[breast cancer, STK11, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[breast cancer, ITPR1, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[breast cancer, TARS, STUB1]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[breast cancer, HADH, STUB1]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             [n in nodes(p) | n.name]\n",
       "0         [breast cancer, GPI, STUB1]\n",
       "1      [breast cancer, HSPA1B, STUB1]\n",
       "2       [breast cancer, KCNN4, STUB1]\n",
       "3        [breast cancer, TFRC, STUB1]\n",
       "4   [breast cancer, HIST1H2BK, STUB1]\n",
       "5       [breast cancer, FOXQ1, STUB1]\n",
       "6        [breast cancer, KRT8, STUB1]\n",
       "7         [breast cancer, AHR, STUB1]\n",
       "8       [breast cancer, SPRY1, STUB1]\n",
       "9        [breast cancer, RARB, STUB1]\n",
       "10       [breast cancer, FHL2, STUB1]\n",
       "11     [breast cancer, BABAM1, STUB1]\n",
       "12         [breast cancer, F3, STUB1]\n",
       "13        [breast cancer, SRC, STUB1]\n",
       "14      [breast cancer, NR2F6, STUB1]\n",
       "15       [breast cancer, IGF1, STUB1]\n",
       "16       [breast cancer, LSP1, STUB1]\n",
       "17      [breast cancer, ALDOA, STUB1]\n",
       "18      [breast cancer, FGFR2, STUB1]\n",
       "19       [breast cancer, E2F1, STUB1]\n",
       "20       [breast cancer, ARAF, STUB1]\n",
       "21      [breast cancer, STK11, STUB1]\n",
       "22      [breast cancer, ITPR1, STUB1]\n",
       "23       [breast cancer, TARS, STUB1]\n",
       "24       [breast cancer, HADH, STUB1]"
      ]
     },
     "execution_count": 297,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene {name:\"STUB1\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "id": "a1b5a8d0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[breast cancer, KIF2C, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[breast cancer, CCNB2, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[breast cancer, GLI2, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[breast cancer, RAD54L, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[breast cancer, CCT5, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[breast cancer, PCNA, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[breast cancer, CDKN1B, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[breast cancer, LDHB, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[breast cancer, AURKA, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[breast cancer, CDC20, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[breast cancer, PYCR1, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[breast cancer, CDA, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[breast cancer, HSP90AA1, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[breast cancer, RPS7, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[breast cancer, AURKA, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[breast cancer, CASP3, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[breast cancer, PPAP2A, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[breast cancer, TNFSF4, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[breast cancer, ALK, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[breast cancer, CDK4, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[breast cancer, SMC4, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[breast cancer, HJURP, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[breast cancer, HIF1A, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[breast cancer, EGR1, DYNLT3]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[breast cancer, ERBB2, DYNLT3]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             [n in nodes(p) | n.name]\n",
       "0      [breast cancer, KIF2C, DYNLT3]\n",
       "1      [breast cancer, CCNB2, DYNLT3]\n",
       "2       [breast cancer, GLI2, DYNLT3]\n",
       "3     [breast cancer, RAD54L, DYNLT3]\n",
       "4       [breast cancer, CCT5, DYNLT3]\n",
       "5       [breast cancer, PCNA, DYNLT3]\n",
       "6     [breast cancer, CDKN1B, DYNLT3]\n",
       "7       [breast cancer, LDHB, DYNLT3]\n",
       "8      [breast cancer, AURKA, DYNLT3]\n",
       "9      [breast cancer, CDC20, DYNLT3]\n",
       "10     [breast cancer, PYCR1, DYNLT3]\n",
       "11       [breast cancer, CDA, DYNLT3]\n",
       "12  [breast cancer, HSP90AA1, DYNLT3]\n",
       "13      [breast cancer, RPS7, DYNLT3]\n",
       "14     [breast cancer, AURKA, DYNLT3]\n",
       "15     [breast cancer, CASP3, DYNLT3]\n",
       "16    [breast cancer, PPAP2A, DYNLT3]\n",
       "17    [breast cancer, TNFSF4, DYNLT3]\n",
       "18       [breast cancer, ALK, DYNLT3]\n",
       "19      [breast cancer, CDK4, DYNLT3]\n",
       "20      [breast cancer, SMC4, DYNLT3]\n",
       "21     [breast cancer, HJURP, DYNLT3]\n",
       "22     [breast cancer, HIF1A, DYNLT3]\n",
       "23      [breast cancer, EGR1, DYNLT3]\n",
       "24     [breast cancer, ERBB2, DYNLT3]"
      ]
     },
     "execution_count": 298,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Disease {name: \"breast cancer\"}),(d:Gene {name:\"DYNLT3\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a69721b0",
   "metadata": {},
   "source": [
    "# USECASE 2 : Finding compound for one of the genes found in usecase 1"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "17814e0a",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 308,
   "id": "4ceae5b5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'345'"
      ]
     },
     "execution_count": 308,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gene_id = run_query(\"\"\"\n",
    "MATCH (s:Gene)\n",
    "WHERE s.name = \"SMC4\"\n",
    "RETURN toString(id(s)) as id\n",
    "\"\"\")['id'][0]\n",
    "\n",
    "gene_id"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0297ddd8",
   "metadata": {},
   "source": [
    "### Analysis using Complex model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 309,
   "id": "49ba1ec1",
   "metadata": {},
   "outputs": [],
   "source": [
    "pred_d = predict_target(\n",
    "    model=result.model,\n",
    "    tail=gene_id,\n",
    "    relation=\"downregulates\",\n",
    "    triples_factory=result.training,\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 310,
   "id": "1f6b8188",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id      score head_label\n",
       "15772    15772  58.163986        577\n",
       "17108    17108  54.876755       7141\n",
       "17098    17098  54.188519        713\n",
       "7173      7173  50.922840      17348\n",
       "17709    17709  50.907528        775\n",
       "...        ...        ...        ...\n",
       "12028    12028 -50.278778      22303\n",
       "17948    17948 -51.419437        799\n",
       "4936      4936 -53.656712      15067\n",
       "19476    19476 -53.952469       9538\n",
       "9131      9131 -58.113907      19362\n",
       "\n",
       "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 310,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 311,
   "id": "b0ad2427",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id      score head_label\n",
       "15772    15772  58.163986        577\n",
       "17108    17108  54.876755       7141\n",
       "17098    17098  54.188519        713\n",
       "7173      7173  50.922840      17348\n",
       "17709    17709  50.907528        775\n",
       "...        ...        ...        ...\n",
       "12028    12028 -50.278778      22303\n",
       "17948    17948 -51.419437        799\n",
       "4936      4936 -53.656712      15067\n",
       "19476    19476 -53.952469       9538\n",
       "9131      9131 -58.113907      19362\n",
       "\n",
       "[19903 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 311,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered_d = pred_d.filter_triples(training)\n",
    "pred_filtered_d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 312,
   "id": "7b70853c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id      score head_label  in_training  in_validation  in_testing\n",
       "15772    15772  58.163986        577        False          False       False\n",
       "17108    17108  54.876755       7141        False          False       False\n",
       "17098    17098  54.188519        713        False          False       False\n",
       "7173      7173  50.922840      17348        False          False       False\n",
       "17709    17709  50.907528        775        False          False       False\n",
       "...        ...        ...        ...          ...            ...         ...\n",
       "12028    12028 -50.278778      22303        False          False       False\n",
       "17948    17948 -51.419437        799        False          False       False\n",
       "4936      4936 -53.656712      15067        False          False       False\n",
       "19476    19476 -53.952469       9538        False          False       False\n",
       "9131      9131 -58.113907      19362        False          False       False\n",
       "\n",
       "[19903 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 312,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated_d = pred_filtered_d.add_membership_columns(training=training, validation=validation, testing=testing)\n",
    "pred_annotated_d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 313,
   "id": "35a51e51",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['577',\n",
       " '7141',\n",
       " '713',\n",
       " '17348',\n",
       " '775',\n",
       " '11449',\n",
       " '12071',\n",
       " '17355',\n",
       " '5193',\n",
       " '9257',\n",
       " '11379',\n",
       " '21727',\n",
       " '10982',\n",
       " '16427',\n",
       " '917',\n",
       " '15790',\n",
       " '8973',\n",
       " '22400',\n",
       " '18623',\n",
       " '1888',\n",
       " '18026',\n",
       " '16346',\n",
       " '13416',\n",
       " '1754',\n",
       " '18365',\n",
       " '10434',\n",
       " '6207',\n",
       " '8783',\n",
       " '13802',\n",
       " '21577',\n",
       " '898',\n",
       " '2921',\n",
       " '16026',\n",
       " '888',\n",
       " '2907',\n",
       " '2977',\n",
       " '4478',\n",
       " '10619',\n",
       " '17246',\n",
       " '22502',\n",
       " '12141',\n",
       " '9284',\n",
       " '8336',\n",
       " '6889',\n",
       " '16525',\n",
       " '10784',\n",
       " '21113',\n",
       " '20699',\n",
       " '16516',\n",
       " '2461']"
      ]
     },
     "execution_count": 313,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_d = pred_annotated_d.df\n",
    "\n",
    "candidate_nodes_d = df_d[df_d['in_training'] == False].head(50)['head_label'].to_list()\n",
    "\n",
    "candidate_nodes_d\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 314,
   "id": "fcbea3f4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 314,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($gene_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca) and \"Compound\" in labels(c)\n",
    "MERGE (c)-[:downreg_c_usecase2]->(n)\n",
    "\"\"\", {'gene_id':gene_id, 'candidates': candidate_nodes_d})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 315,
   "id": "05e38fd7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Compound</th>\n",
       "      <th>Gene</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cyclothiazide</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Prednisone</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Thiotepa</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Compound  Gene\n",
       "0  Cyclothiazide  SMC4\n",
       "1     Prednisone  SMC4\n",
       "2       Thiotepa  SMC4"
      ]
     },
     "execution_count": 315,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Compound)-[:downreg_c_usecase2]->(d:Gene)\n",
    "RETURN c.name as Compound, d.name as Gene\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "46da9a19",
   "metadata": {},
   "source": [
    "### Analysis using TransE model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 316,
   "id": "ea3d5dfe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id      score head_label\n",
       "4040      4040  -6.987144      14149\n",
       "7709      7709  -7.176988      17897\n",
       "14711    14711  -7.318759       4685\n",
       "285        285  -7.319709      10290\n",
       "2539      2539  -7.341794      12608\n",
       "...        ...        ...        ...\n",
       "12490    12490 -14.326984       2395\n",
       "12025    12025 -14.328463       2230\n",
       "13991    13991 -14.413631       3949\n",
       "16919    16919 -14.427435       6947\n",
       "17496    17496 -14.738400       7532\n",
       "\n",
       "[19930 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 316,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_d = predict_target(\n",
    "    model=result2.model,\n",
    "    tail=gene_id,\n",
    "    relation=\"downregulates\",\n",
    "    triples_factory=result2.training,\n",
    ")\n",
    "pred_d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 317,
   "id": "89b9fed5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id      score head_label\n",
       "4040      4040  -6.987144      14149\n",
       "7709      7709  -7.176988      17897\n",
       "2539      2539  -7.341794      12608\n",
       "754        754  -7.447429      10779\n",
       "11483    11483  -7.452220      21750\n",
       "...        ...        ...        ...\n",
       "12490    12490 -14.326984       2395\n",
       "12025    12025 -14.328463       2230\n",
       "13991    13991 -14.413631       3949\n",
       "16919    16919 -14.427435       6947\n",
       "17496    17496 -14.738400       7532\n",
       "\n",
       "[19903 rows x 3 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 317,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_filtered_d = pred_d.filter_triples(training)\n",
    "pred_filtered_d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 318,
   "id": "c504531d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "TargetPredictions(df=       head_id      score head_label  in_training  in_validation  in_testing\n",
       "4040      4040  -6.987144      14149        False          False       False\n",
       "7709      7709  -7.176988      17897        False          False       False\n",
       "2539      2539  -7.341794      12608        False          False        True\n",
       "754        754  -7.447429      10779        False          False       False\n",
       "11483    11483  -7.452220      21750        False          False       False\n",
       "...        ...        ...        ...          ...            ...         ...\n",
       "12490    12490 -14.326984       2395        False          False       False\n",
       "12025    12025 -14.328463       2230        False          False       False\n",
       "13991    13991 -14.413631       3949        False          False       False\n",
       "16919    16919 -14.427435       6947        False          False       False\n",
       "17496    17496 -14.738400       7532        False          False       False\n",
       "\n",
       "[19903 rows x 6 columns], factory=TriplesFactory(num_entities=19930, num_relations=10, create_inverse_triples=False, num_triples=450172), target='head', other_columns_fixed_ids=(4, 13507))"
      ]
     },
     "execution_count": 318,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pred_annotated_d = pred_filtered_d.add_membership_columns(training=training, validation=validation, testing=testing)\n",
    "pred_annotated_d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 321,
   "id": "9dd70aa5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['14149',\n",
       " '17897',\n",
       " '12608',\n",
       " '10779',\n",
       " '21750',\n",
       " '18131',\n",
       " '9349',\n",
       " '17133',\n",
       " '13726',\n",
       " '16565',\n",
       " '11388',\n",
       " '1278',\n",
       " '5972',\n",
       " '913',\n",
       " '22096',\n",
       " '3099',\n",
       " '6832',\n",
       " '19130',\n",
       " '11213',\n",
       " '283',\n",
       " '17046',\n",
       " '13667',\n",
       " '19473',\n",
       " '1796',\n",
       " '20343',\n",
       " '9052',\n",
       " '15522',\n",
       " '11912',\n",
       " '14874',\n",
       " '10838',\n",
       " '322',\n",
       " '10808',\n",
       " '7714',\n",
       " '15833',\n",
       " '5070',\n",
       " '4407',\n",
       " '13047',\n",
       " '18634',\n",
       " '9825',\n",
       " '19270',\n",
       " '6113',\n",
       " '6216',\n",
       " '1303',\n",
       " '22395',\n",
       " '4360',\n",
       " '1595',\n",
       " '10144',\n",
       " '4437',\n",
       " '9836',\n",
       " '20460']"
      ]
     },
     "execution_count": 321,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_d = pred_annotated_d.df\n",
    "\n",
    "candidate_nodes_d = df_d[df_d['in_training'] == False].head(50)['head_label'].to_list()\n",
    "\n",
    "candidate_nodes_d\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 322,
   "id": "f0dd3adc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 322,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (n)\n",
    "WHERE id(n) = toInteger($gene_id)\n",
    "UNWIND $candidates as ca\n",
    "MATCH (c)\n",
    "WHERE id(c) = toInteger(ca) and \"Compound\" in labels(c)\n",
    "MERGE (c)-[:downreg_t_usecase2]->(n)\n",
    "\"\"\", {'gene_id':gene_id, 'candidates': candidate_nodes_d})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 323,
   "id": "6ba3f3c1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Compound</th>\n",
       "      <th>Gene</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Vemurafenib</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Pitavastatin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Azacitidine</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Digitoxin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bisacodyl</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Clofarabine</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Digoxin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Thioridazine</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Treprostinil</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Sirolimus</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Vorinostat</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Varenicline</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Isotretinoin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Dactinomycin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Nizatidine</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Albendazole</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Fluvastatin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Betamethasone</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Bortezomib</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Podofilox</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Ouabain</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Daunorubicin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Clopidogrel</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Bupropion</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Everolimus</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Trametinib</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Pentamidine</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Paclitaxel</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Simvastatin</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Busulfan</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Mebendazole</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Homoharringtonine</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Fluticasone Propionate</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Disulfiram</td>\n",
       "      <td>SMC4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  Compound  Gene\n",
       "0              Vemurafenib  SMC4\n",
       "1             Pitavastatin  SMC4\n",
       "2              Azacitidine  SMC4\n",
       "3                Digitoxin  SMC4\n",
       "4                Bisacodyl  SMC4\n",
       "5              Clofarabine  SMC4\n",
       "6                  Digoxin  SMC4\n",
       "7             Thioridazine  SMC4\n",
       "8             Treprostinil  SMC4\n",
       "9                Sirolimus  SMC4\n",
       "10              Vorinostat  SMC4\n",
       "11             Varenicline  SMC4\n",
       "12            Isotretinoin  SMC4\n",
       "13            Dactinomycin  SMC4\n",
       "14              Nizatidine  SMC4\n",
       "15             Albendazole  SMC4\n",
       "16             Fluvastatin  SMC4\n",
       "17           Betamethasone  SMC4\n",
       "18              Bortezomib  SMC4\n",
       "19               Podofilox  SMC4\n",
       "20                 Ouabain  SMC4\n",
       "21            Daunorubicin  SMC4\n",
       "22             Clopidogrel  SMC4\n",
       "23               Bupropion  SMC4\n",
       "24              Everolimus  SMC4\n",
       "25              Trametinib  SMC4\n",
       "26             Pentamidine  SMC4\n",
       "27              Paclitaxel  SMC4\n",
       "28             Simvastatin  SMC4\n",
       "29                Busulfan  SMC4\n",
       "30             Mebendazole  SMC4\n",
       "31       Homoharringtonine  SMC4\n",
       "32  Fluticasone Propionate  SMC4\n",
       "33              Disulfiram  SMC4"
      ]
     },
     "execution_count": 323,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Compound)-[:downreg_t_usecase2]->(d:Gene)\n",
    "RETURN c.name as Compound, d.name as Gene\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 325,
   "id": "49c2cbc6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>[n in nodes(p) | n.name]</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[SMC4, SLC2A6, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[SMC4, INPP4B, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[SMC4, CREG1, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[SMC4, UGDH, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[SMC4, NBR1, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[SMC4, CBS, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[SMC4, PAN2, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[SMC4, HSPA8, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[SMC4, TUBB3, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[SMC4, KAT6B, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[SMC4, TUBB2A, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[SMC4, RBKS, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[SMC4, DNM1L, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[SMC4, VDAC1, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[SMC4, CCDC86, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[SMC4, EIF4EBP1, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[SMC4, TBC1D31, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[SMC4, HSD17B8, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[SMC4, ATP6V0B, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[SMC4, CDKN1A, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[SMC4, MTHFD2, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[SMC4, TIMP1, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[SMC4, WARS, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[SMC4, PUF60, Vemurafenib]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[SMC4, DNTTIP2, Vemurafenib]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         [n in nodes(p) | n.name]\n",
       "0     [SMC4, SLC2A6, Vemurafenib]\n",
       "1     [SMC4, INPP4B, Vemurafenib]\n",
       "2      [SMC4, CREG1, Vemurafenib]\n",
       "3       [SMC4, UGDH, Vemurafenib]\n",
       "4       [SMC4, NBR1, Vemurafenib]\n",
       "5        [SMC4, CBS, Vemurafenib]\n",
       "6       [SMC4, PAN2, Vemurafenib]\n",
       "7      [SMC4, HSPA8, Vemurafenib]\n",
       "8      [SMC4, TUBB3, Vemurafenib]\n",
       "9      [SMC4, KAT6B, Vemurafenib]\n",
       "10    [SMC4, TUBB2A, Vemurafenib]\n",
       "11      [SMC4, RBKS, Vemurafenib]\n",
       "12     [SMC4, DNM1L, Vemurafenib]\n",
       "13     [SMC4, VDAC1, Vemurafenib]\n",
       "14    [SMC4, CCDC86, Vemurafenib]\n",
       "15  [SMC4, EIF4EBP1, Vemurafenib]\n",
       "16   [SMC4, TBC1D31, Vemurafenib]\n",
       "17   [SMC4, HSD17B8, Vemurafenib]\n",
       "18   [SMC4, ATP6V0B, Vemurafenib]\n",
       "19    [SMC4, CDKN1A, Vemurafenib]\n",
       "20    [SMC4, MTHFD2, Vemurafenib]\n",
       "21     [SMC4, TIMP1, Vemurafenib]\n",
       "22      [SMC4, WARS, Vemurafenib]\n",
       "23     [SMC4, PUF60, Vemurafenib]\n",
       "24   [SMC4, DNTTIP2, Vemurafenib]"
      ]
     },
     "execution_count": 325,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_query(\"\"\"\n",
    "MATCH (c:Gene {name: \"SMC4\"}),(d:Compound {name:\"Vemurafenib\"})\n",
    "WITH c,d\n",
    "MATCH p=AllShortestPaths((c)-[r:binds|regulates|interacts|upregulates|downregulates|associates*1..4]-(d))\n",
    "RETURN [n in nodes(p) | n.name] LIMIT 25\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6af7d56b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
